[
  {
    "Question_id": 1,
    "Question": "Hello! I'm not sure if I'm doing this in the right section but I'm a SSgt in the Air Force, I've been in 4 years. Well September of 2014 I was hit by a car that was doing 40 mph and suffered a TBI as well as a few broken ribs and a broken neck. I just entered the med board process in September of 2015 and I'm about to have my last medical evaluation on Friday. I'm curious as to how you figure out your medical retirement pay as well as VA pay if you go that route. I know you can only choose one or the other though. I currently have my fingers crossed with medical retirement which everyone tells me I'm going to get but I'm not expecting it either way. Well just wanted to introduce myself as I've looked over the forum numerous times this year.",
    "Response_1": "Hi,\n\nFirst of all you don not get to choose VA or DOD its which ever is the higher of the 2 which is more then likely VA. now you don't get to chose retirement it depends if your unfitting condition is 30% or above. Below 20% DOD you will get a severance check. if you do end up retiring your pay will most likely be based off of your VA rating because your VA percentage will be higher/higher pay rate. You can google VA Paycharts and you will see the breakdown of payments.\n\nhttp://www.dfas.mil/militarymembers/woundedwarrior/disabledretireest.html\n\nthis site will help the most. good luck",
    "Response_2": "It is being a little picky, but this isn't fully accurate. DoD pay is offset by VA pay. This is more accurate than \nSo lets imagine you are unfit at 50%. VA rating is 60%. High 3 is 3600. \nDoD retirement pay would be $1800/month.\nVA compensation, w/ spouse would be about $1150/month.\n\nVA comp is lower, but you will still receive it. It's tax free, protected from creditors, overall better. Each dollar from the VA then lowers the DoD pay by a dollar, this is the offset. Unless eligible for concurrent receipt through CRSC or CRDP.\n\nSo you get $1150 tax free from the VA, and $650 that is taxed from DFAS in this scenario.\n\nThe problem is that DoD pay is offset by VA pay doesn't carry much meaning. WTF does offset mean? Most people have significantly higher VA ratings than DoD ratings, which makes it so most people only see the VA pay. Generally its easier to just tell people they'll only get the VA pay. The retirement is only important for TRICARE and the id card. That's the short and simple answer that works about 90% of the time.\nThis is really hard to answer until you know what your ratings are. Then they will provide the break down for you. If you want to know ahead of time you have to make guesses. Reading the VASRD to understand how each condition is rated is the only way to come to a guess.",
    "Response_3": "Without knowing your limitations in regards to TBI, there are a couple of benefits that you may want to look into.\n\nThe first is T-SGLI, it is a supplemental insurance that comes with your SGLI, it is for injuries that are sustained from a traumatic event, a car accident may qualify. Read through this: http://www.benefits.va.gov/insurance/tsgli.asp\n\nThe second is SMC(t) which is special medical compensation from the VA, here is a power point slide on it, there is a lot of information, so please ask questions if you have any. http://www.purpleheart.org/ServiceProgram/Training2012/10-M- SMC final.pdf",
    "Response_4": "Worse case is 0%. TBI is a wierd one. Just saying TBI is close to meaningless, mainly because there is a good amount of mTBI being talked about lately, and the majority of mTBI is asymptomatic. Without symptoms, nothing to rate. The most common symptoms usually end up getting rated outside the TBI criteria. Migraines, vertigo, hearing, PTSD, lots of times those get associated with TBI and get separate rating codes, so really a single TBI event can get up above 100% and into SMC codes. A 10% or 30% for cognitive/memory problems is probably what I hear about most often under the TBI code or a 10% for headaches.\n\nNeck is usually 10% or 20%, usually depends on how far you can move it. Broken ribs usually heal, so 0%, but can get higher if there are residual breathing problems. Lots of variables, really have to go with the specifics of your symptoms, not just the diagnosis.",
    "Response_5": 0
  },
  {
    "Question_id": 2,
    "Question": "My husband just got his ratings. They combined the PTSD and TBI. 50% Basically every TBI residual is stated to be caused by PTSD and not able to rated separately. TBI is already diagnosed. They are just rated it with PTSD and gave it a single rating. Anyone have any luck here getting them separated? Thanks",
    "Response_1": "VA does combine and separate diagnosis regularly and they are supposed to do it to the benefit of the member.\nIt may be that by combining them under one rating yields a higher percentage. remember that VA math is different when adding separate ratings. 2+2= less than 4. It's very possible that the TBI on it's own is say 10% and the PTSD is 50% but when they rate them together it's 70%\nwith that said, if it is 50% with them combined, I would want them separated. Reason being is the minimum for PTSD by itself is %50 for a member being separated. So if combining them together didn't yield higher I would want the TBI broken out on it's own in hopes of rating higher than 0% for that one item.\nHope that made sense!",
    "Response_2": "The symptoms caused by PTSD and TBI are very similar. Parsing them apart is often impossible. Know whether the event itself caused the symptoms (TBI) or the psychological response to the event caused the symptoms (PTSD) is often impossible to distinguish. \n\nDo you mind sharing more about the vertigo and migraines?",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 3,
    "Question": "Hi everyone! I've been following this thread for a while now, as I suffered two TBI's in the past 12 months and the last one really got me good. I've been diagnosed with migraines that cannot be controlled by medications, have tried a full range of medications (Relpax, Zomig, Gabopentin, etc.) to some other ones, received BOTOX treatment in November 2015 without any success, still going to try it again in Feb 2016 as my condition is getting worse (and I am just really struggling to go through the days now). It started with consistent migraines after physical exertion (after the first TBI) to now it's a wide range of things that flare up my migraines: fluorescent light, sound, diesel fumes, physical exertion, stress, anxiety. I've also been having problems with sleeping and went through the sleep studies and had been diagnosed with chronic insomnia, anxiety and migraines by the doctors at the sleep center. It's been more than a year since the first TBI and finally this month I entered the MEB process. My direct NCO has been really supportive and understanding of migraines that I get as he was present when the last TBI happened. (Had a heavy light set fell on my head out of connex).\n\nI know that there is a lot of information posted on the threads in here, but I was wondering what to expect as far as MEB? What are the C&P's? What are the VA doctors like? I have my initial meeting with the person... not really sure what her title is, and she is supposed to give me a memo to take to my command, what happens after that?\n\nthank you in advance for your insights and information!",
    "Response_1": "Indeed, I am sadden to read about your current medical situation albeit the referral with acceptance into the DoD IDES was definitely the proper avenue of approach by your medical healthcare providers that this point in time for sure!\n\nIn reference to your specific inquiry \"What are the VA doctors like?\" from my experiences when in the DoD IDES process, I offer the viewing of my URL http://www.pebforum.com/site/thread...tements-within-c-p-examination-reports.18732/. As such, the DoVA Compensation and Pension (C&P) examinations are the medical documentation of record used by the MEB Physician to generate the Narrative Summary (NARSUM).\n\nNonetheless, please reference my specific URL for a detailed explanation about the DoD IDES MEB/PEB process:\nhttp://www.pebforum.com/site/threads/a-detailed-explanation-of-the-dod-ides-meb-peb-process.22807/\nOf most importance in my opinion while in the DoD IDES, never default acceptance to any injustices; fight then continue to fight some more until receipt of all desired outcomes supportive via medical evidence and/or medical documentation!\n\nMoreover, if you foresee that your current medical impairment(s) shall have a severe affect on any potential future employment upon the successful completion of the DoD IDES process, you may want to consider applying now for SSA SSDI federal disability compensation. As such, I offer my following URL for additional information to potentially yield some assistance in the pursuit for any SSA SSDI disability compensation benefits:\nhttp://www.pebforum.com/site/thread...disability-insurance-ssdi-compensation.24005/\nWith that all said, please take care and I hope for much success during your DoD IDES process proceedings! :cool:\n\nThus, I quite often comment that \"possessing well-informed knowledge is truly a powerful equalizer!\"\n\nBest Wishes!",
    "Response_2": "C&P's are the compensation and pension exams that are either conducted by the VA itself, or a contractor the VA uses such as QTC.\n\nYou may be subjected to two different forms of VA doctors, those who will treat you for your injury and those who perform an examination for the basis of completing the disability benefits questionnaire (DBQ).\n\nTypically the MEB process works like this, you are given a MEB referral by your primary care physician, you are then assigned a Physical Evaluation Board Liaison Officer (PEBLO). Those are on the DoD side, on the VA side you are given a Military Service Coordinator (MSC) who assists you in filing your VA claim.\n\nYour TBI is rated based upon the residual conditions that are associated with it. There are 10 facets that the VA looks at when determining the rating. The ten facets are below:\n\nMEMORY, JUDGMENT, SOCIAL INTERACTION, ORIENTATION, MOTOR ACTIVITY, VISUAL SPATIAL, SUBJECTIVE, NEURO BEHAVIORAL, COMMUNICATION, CONSCIOUSNESS\n\nYou are given a rating of 0-3 and total in each of the areas by the examiner (0 = 0%, 1 - 10%, 2 - 40% and 3 = 70%, total = 100%) , who uses information found in your medical records as well as a face to face physical exam. You may be given neuropsychological testing.\n\nMigraines are not considered a cognitive impairment and should be rated separately from the TBI.\n\nHere is the rating schedule for migraines:\n\nWith very frequent completely prostrating and prolonged attacks productive of severe economic inadaptability 50%\nWith characteristic prostrating attacks occurring on an average once a month over last several months 30%\nWith characteristic prostrating attacks averaging one in 2 months over last several months 10%\nWith less frequent attacks 0%",
    "Response_3": "Commanders' letter count, but they do not necessarily trump medical records. I had to MEB's, in both a cases the CC wrote a retain letter. During the first MEB I was retain, but on the second one I was retired. My only point is that the CC letter is not the final word.",
    "Response_4": "Typically you do not bring anything to the C&P appointments, however you need to make sure they are getting to the MEB medical records technician. If they are not already in your AHLTA notes and the NARSUM does not acknowledge the frequency, you can do an IMR and present them to the reviewing physician.",
    "Response_5": "In my opinion, your immediate supervisor and buddy statements should provide additional validating evidence of your medical impairments albeit what is your expectation from the DoD IDES MEB/PEB process at this point (e.g., a \"fit for duty\" determination or an \"unfit for duty\" determination)? \n\nAs such, based upon your response to the aforementioned question may offer a potential course of action with the submission any additional medical evidence and/or medical documentation in order to assist your DoD IDES outcome desires.\n\nIn reference to the Commander's Statement, I concur with @chaplaincharlie's feedback; it's an important document but the overall determination of any \"medically acceptable\" or \"medically unacceptable\" finding by the DoD IDES MEB should be based upon the available totality of all medical evidence and medical documentation.\n\nWith that all said, please take care and I hope for much success during your DoD IDES process proceedings! :cool:\n\nThus, I quite often comment that \"possessing well-informed knowledge is truly a powerful equalizer!\"\n\nBest Wishes!"
  },
  {
    "Question_id": 4,
    "Question": "Keeping this from being long winded, I filed for PCS a while back when the VA didn't recognize it. In 2013 I had a TBI screen which I was told was negative. About a year later I filed for residuals of TBI. Was denied real fast and have an appeal currently sitting in some dark room.\n\nAnyways I have been reading doctors notes form the VA for visits since 2010 and finally stumbled on notes entered about my TBI screen in 2013. The doctors notes say the screen was positive and consult for further eval. It also listed 7 or 8 symptoms that I was having problems with. The end of the notes concluded with...\n\"Positive screen. Results of TBI Screen discussed with patient.\nConsult for further evaluation discussed with patient and the patient agrees. Consult order entered.\nTBI Comprehensive Screening Consult.\"\n\nMaybe I am reading this incorrectly but since 2013 they have clearly said my TBI screen was negative. My wife had concerns about this in 2014 when I was having a hard time with some things and I called again about scheduling an appointment for it but they said no need to since my screening was negative. For me to talk to my docs on the mental health team. I never had any sort of follow up concerning TBI.\n\nDoes anybody have a different interpretation of what these notes mean. I feel like I am going crazy sometimes and seeing things the way I want to see them. I don't even bother with asking my wife anymore about things. She has lost all patience with me.",
    "Response_1": "Yes, I agree, positive does not mean the same thing as negative. I don't know the solution, and I would think there would be some route to one given such a clear answer on the screening. I will note, however, that squeaky wheels tend to get the grease. Persistently bring up symptoms you want treatment for until satisfied is my only recommendation. It may come down to there is no good treatment for the symptoms, but that's not the same thing as letting a doc tell you a symptom doesn't exist.\n\nI have noticed that many causes of friction with the medical word is over diagnosis. Diagnosis is for the Docs, symptoms are for the patient, they don't like you on their turf. It doesn't matter if they call it TBI, organic brain damage, or bent brain or anything else even more silly. Don't ask for treatment of your TBI. Ask for treatment of the memory problems, the ones that have been happening and getting worse since the IED exploded back in '09, or what have you. They get to tell you all day long that you don't have TBI, that's their job. They don't get to tell you that you don't have memory problems (not without proof).\n\nThat question is a little different than the one over ratings. There it may matter that they call it TBI. However if you string together the symptoms and cause/effects and get the right treatment, that will usually work itself out.",
    "Response_2": "The big problem with TBI is its really fairly meaningless when it comes to treatment. TBI means your brain was knocked around. Ok, great, you know the cause, but they can't really go in with a scalpel to fix that. They really kinda have to break it down into what they can treat. Sleep problems, they got pills and machines and stuff for that. That causes memory and mood problems. If I was a doc, that'd be how I'd want to go about things. I'd want to look at the stuff I can help my patient with first and then give him the, sorry, this is just the new you, after I ruled all that out. In many ways TBI means its just the new you. They might offer you some counseling and some coping strategies and stuff to help ease the problems, but no real fixes.\n\nThat is all from the VHA perspective, the docs and hospitals. The question becomes different if you're talking TBI from the VBA perspective. Sometimes understanding and working with the VA is easier if you can distinguish between the VHA and the VBA. This can be hard, the benefits and the docs are so intertwined, and in many ways it is for the docs as well. Its quite possible the don't want you to start looking at a TBI claim and are mindful of how their write-ups may support that. They work for the government, and its part and parcel, a good government worker bee looks to save the government money, and some view hindering a claim as saving the government money. Its BS, if true, but I'd believe it.\n\nBut in reality, the timeline for symptoms presenting compared to the TBI event is probably going to be more important than the name they call it. Its also a good reason why C&P examiners are separate from people who treat you, the question of benefits and treatment really are quite separate. You can easily flip the script for your claim. Ok, so memory problems (or other symptoms) are caused by my sleep problems and depression. Well, if the sleep problems and depression started right after the TBI, why can't you say the sleep problems and the depression were caused by the TBI? Last I heard the brain controls pretty much everything, so why is that invalid? If those problems didn't start at the same time as the TBI, but the memory problems did, well that pretty neatly puts a cork in the bottle.",
    "Response_3": "Indeed, you make some valid points in my opinion as I have experienced similar tactics by a VA clinician treating my TBI (which is actually a mild TBI (mTBI) and well documented while on active duty in U.S. Army military service).\n\nBottom line, the VA clinician ordered numerous \"residual\" medical appointments to try to officially \"rule-out\" my mTBI medical condition, but the results all \"supported\" evidence of a mTBI collectively. Sadly, the VA clinician still would not \"connect the dots\" in reference to the \"residuals of a TBI\" and stated that my cognitive/memory problems are more mental health related.\n\nSo, the VHA fight continues while implementing a different strategy with the VBA by using the DSM-V recognized \"Post Concussion Syndrome\" symptomology which is medically the same as a mTBI.\n\nSadly, certain individuals employed within the VHA and VBA are fully aware of their self-proclaimed \"efforts\" to try to potentially assist the U.S. Government with any eventual cost-saving initiatives in my opinion.\n\nThus, I quite often comment that \"possessing well-informed knowledge is truly a powerful equalizer.\"\n\nBest Wishes!",
    "Response_4": "I have a different take on this, the clinician is required to treat your symptoms (whether or not you have mTBI or a BH condition).\n\nDoes it really matter whether it is called mTBI or XXYZTP? Not really, what matters is that the VA provide you with solutions to your symptoms, as for residuals of mTBI there are many.\n\nIt takes a \"systems\" approach to dealing with the residuals of TBI.\n\nThere are many of the body's systems that are affected, you can have memory and cognition issues, motor skills issues, sensory depravation issues, pulmonary depravation issues, and of course issues with your psyche.\n\nThere is no one solution for everyone, everything differs.",
    "Response_5": "ndeed, I would concur albeit the TBI Clinic's VA clinician seems to be utilizing the \"systems\" approach to keep her job (in my opinion), but won't \"connect-the-dots\" with all of the other TBI referral appointment results to make an official \"residual of TBI\" diagnosis for VHA purposes.\n\nAs such, that's her opinion, but I don't accept it at this point in time because my symptomology via all medical evidence and medical documentation \"collectively\" states otherwise!\n\nAnd so, the fight shall continue until officially resolved either via VHA channels (e.g., a \"residual of TBI\" official diagnosis) and/or VBA channels (e.g., military service-connection via \"Post Concussion Syndrome\" under DSM-V criteria). ;) Appreciate your additional feedback; thanks! :)\n\nThus, I quite often comment that \"possessing well-informed knowledge is truly a powerful equalizer.\"\n\nBest Wishes!"
  },
  {
    "Question_id": 5,
    "Question": "So I suffered a concussion from a blast in 2003.. I don't think \"TBI\" was going around then. I ended up filling out TBI Screening forms at Mental Health with no follow up on them. I got a concussion from a 50cal barrel in 2006, same thing, filled out a peice of paper.... Had another incident involving loss of consciosness (sp?) in 2011 where I was sent to the ER.. .still nothing.. am I doing something wrong here?",
    "Response_1": "I was in a similar situation with all the signs and symptoms of TBI, but tested negative on the screening. I finally had to list all the issues similar to what you did in the first post and tell my primary care provider at the VA that I want an MRI to rule out TBI. I just had the MRI on 18DEC2013 and waiting for results. Push for it and you will get it eventually.\n\nGood Luck",
    "Response_2": "Indeed, continue to follow-up with your Mental Healthcare Clinic for assignment of a behavioral health counselor in order to potentially obtain a TBI, mild TBI or Post Concussion Syndrome (PCS) official diagnosis. \n\nRemember that a PCS diagnosis is now a recognized mental health condition per the DSM-V regulatory criteria which it seems that the DoVA has currently adopted at this point.\n\nTo that extent, never default acceptance to potential injustice; fight then continue to fight some more in my opinion!\n\nThus, I quite often comment that \"possessing well-informed knowledge is truly a powerful equalizer.\"\n\nBest Wishes!",
    "Response_3": "If your MRI doesn't show any positive medical evidence for an official TBI diagnosis, then remember as based upon your symptomatology that either a mild TBI (mTBI) official diagnosis or a Post Concussion Syndrome (PCS) official diagnosis (per new DSM-V criteria) can potentially result.\n\nThus, I quite often comment that \"possessing well-informed knowledge is truly a powerful equalizer.\"\n\nBest Wishes!",
    "Response_4": "I haven't used DVBIC but literally the same thing happened to me. \"TBI\" wasn't really recognized in 06-07 when I was hit so I ended up getting statements from my fellow soldiers. I combined their statements with the medical evidence and ended up with an LOD, which seems like the end all be all of that it actually happened.",
    "Response_5": 0
  },
  {
    "Question_id": 6,
    "Question": "I'm currently going through the Med Board/PEB process, and I was looking for some insight from people who might have had, or still have, a similar condition, or from people who just know a lot more about this than I do.\n\nI was hit in the head nearly two years ago (non-combat related) and suffered a TBI and concussion from the incident. A few weeks later, I started to get migraines accompanied by numbness and tingling in my limbs. The doctor I was seeing sent me to a neurologist, who officially diagnosed the condition as migraines, and began trying to make them bearable for me. As the months went on, I tried a few different medications, but nothing seemed to help, and the migraines continued to get worse/more frequent. About two months after I started experiencing the migraines, I started to have occasional panic attacks as well.\n\nEventually I started seeing a different neurologist who tried botox injections (which also didn't help) and different medications which helped the migraines to be bearable, but not eliminate them. I also started seeing a mental health professional who also prescribed me medication to help with the anxiety, but did not eliminate the condition entirely either. This is my current condition, getting low-grade migraines daily with debilitating migraines once or twice a week accompanied by a Generalized Anxiety Disorder.\n\nMy claim was sent off with TBI, Migraines, and Generalized Anxiety Disorder listed as the main claims and Tinnitus, and low back condition as secondary claims. I've done all of my C&P evaluations, although I haven't seen the results, and the PEB came back wanting more evidence of the anxiety, which came back inconclusive. At this point, I'm still waiting to hear anything back, and I would just like to hear some educated opinions on what my findings might be (fit/unfit, VA and DoD ratings).\n\nThank you all in advance for any insight or advice you might provide me.",
    "Response_1": "I have TBI, Migraines, low back pain and shoulder issues. I just completed my last C&P on April 9th and I'm still waiting on the results and NARSUM. I'll let you know if I hear anything. I'm on nortriptoline(sp?) and I take it everyday. It has reduced the lower level headaches but I still get boomers weekly. Minus the review from MH your case is moving right along it seems.",
    "Response_2": "My PEBLO said the same thing...some PEB's coming back within a week sometimes. Mine has been out for almost a month with no word. I've noticed other folks claiming TBI that it is taking longer. My hope is that they are looking at ours longer because of the injury and that it's not so black and white. My IDES dashboard stopped working too so I'm a little nervous about that as well.\n\nHere's to hoping.....",
    "Response_3": "Good deal, I'm still waiting on my end. It must be because we have TBI. I see and hear so many people getting an unfit/fit memo back from the PEB in a few weeks...you start to wonder when it will come though. Good deal again! Did you have any other unfit items? I had 3 conditions that did not meet retention standards; we'll see if all 3 receive unfit.",
    "Response_4": "It is tough (and much tougher when you are going through it), but, wait times are notoriously variable. A big part of that is the variability of the conditions and the differing quality of the packets and evidence that they contain. If the MEB, the Commander's statement, NARSUM, medical records or VA exams are either poorly written, fail to address items adequately, if the case is complicated, or if the PEB staff is working on a backlog, it may take a lot more time to for a decision than it would in a clear cut case with only one condition. \n\nHow long is a piece of string?\n\nI don't disagree with looking at what others are getting for turnaround times for a decision. But, I really think it is only somewhat useful. Sometimes, it can cause more stress than it's worth.",
    "Response_5": 0
  },
  {
    "Question_id": 7,
    "Question": "I just received my Narsum interview today. TBI and other brain injuries on it. I have already been diagnosed with TBI by army testing. Can anyone tell me how they conduct the VA tests for TBI. My last test took about 8 hrs",
    "Response_1": "http://militarydisabilitymadeeasy.com/tbi.html gives a good breakdown of how the rating happens.\n\nThe VA shouldn't need to do any of the tests that diagnose the condition that you did before, that's established. They just need to determine how disabling it is. This is a bit more complex than saying there is a single test, or battery of tests, because TBI has so many different presentations. What they need to test for will depend on what your TBI looks like. My understanding is that the majority of these are controlled by the veteran based on what the complaints are. If your cognitive ability is jacked to the point where you can't assist, that usually leads to the cognitive portion being the driver for the rating, although some bring in a 3rd party to help paint a clearer picture (i.e. spouse).",
    "Response_2": "Is the neuropsych exam considered objective evidence? I just received my C&P results and I don't think they reviewed my cognitive severity.\n\nI do not believe the examiner looked at my neuropsychological evaluation/letter.\n\n-The examiner �checked� the box forMild memory, attention, concentration, executive function but without objective evidence on testing.\n-On my neuropsych letter she writes that processing speed, working memory, sustained attention and concentration with mental manipulation are Severely impaired. Definitely not mild.\n-My neuropsych letter findings reads almost exactly what the SOR for TBI for �total� on the memory, attention, concentration, executive function section has written.\n\nThanks for the help!",
    "Response_3": "The problem with the neuro psych tests is that it is only really valid as a test to see changes. It requires a baseline test and then it measures the new impairment. Almost nobody has the baseline test. Its just as valid to say you naturally have a \"mild\" impairment and the TBI increased things to \"severe\". Without a baseline the measurement of severity is very subjective, at best it can say that the impairment is present.\n\nEveryone has a different ability to do things like solve the puzzles and remember the phrases. Its not really an impairment to do that slower or forget more words or numbers, that's just kind of how your memory or thought organization works. Its when you can't do it the same as before that the measurement reaches objectivity.\n\nThis was brought up when the DoD got in trouble for rubber stamping post deployment health assessments. There was a need recognized that pre deployment should include a neuro psych test so they actually know how much the deployment effected things. DoD agreed but never acted on it, and really only did lip service to fix the bad post deployment health assessments.\n\nIts worth noting that its only a factor in your evaluation that may not be controlling over your rating. They pick the worst category and that drives the TBI rating, so if one category is severe it doesn't matter that another was considered mild. A single severe category creates the whole condition as severe. Its also worth noting that lay evidence can be pretty persuasive. A co-worker or spouse isn't going to be able to diagnose TBI usually, but they can be pretty reliable and knowledgeable if they observe something like you needing to be reminded constantly, needing written notes to accomplish things, etc. when that wasn't something you did before the injury. A great deal more reliable than a doctor who never observed your function before and doesn't observe your daily impacts, but only a brief window during a high stakes evaluation.",
    "Response_4": "These are really good points and thanks for replying. I'm glad to see they are doing predeployment assessments In 2006 it was not an option and in 2007 when I was hit TBI was not even a 'thing' yet. Since I did not have fluid coming from my ears and sinuses I was considered good to go. How things have changed!",
    "Response_5": 0
  },
  {
    "Question_id": 8,
    "Question": "I had some of my C&P exams today. The TBI portion went well I think. Here's what it was for the 10 facets. 2 severe 3 moderate 3 mild 1 not effected and 1 coherent. Can anyone tell me that's good. I have other questions about today but ok will wait to ask them so I don't confuse myself.",
    "Response_1": "They go by your highest facet being 3 the highest. Im not sure what 2 severe means? It should read as, \"facet category X - 3\" for severe memory loss. If you have just 1 facet being the highest as 3 and rest 0, then you will get the highest percentage awarded. I had a facet of 3 for severe memory loss and was awarded 70%. This should explain it better. If you have more C&P exams you should always be informed. I had a neck injury and didnt know you were suppose to stop before the pain and I ended up getting screwed. I disagreed and redid it and got a better %. The website is below to match your C&P with what they will be doing. Always be informed!\n\nThe document I uploaded, go to page 3 labeled,\" Evaluation of Cognitive Impairment and Subjective Symptoms\" and see what percentage you will get.\n\nwebsite for ratings - http://www.benefits.va.gov/warms/bookc.asp",
    "Response_2": "Thanks I should have wrote I had 2 of the 10 facets as severe. They also check my back neck shoulder all injured during my second blast. Lucky I had someone tell me no matter what is said don't push past. Plus the doctor I had when I would get close to the pain he would same that's about it right. One thing I am still confused about is. They should of checked my knees and feet. Service related not combat related. My doctor said not on list so he can't check it. But he said you have another appointment with me we may be able to check it then. I can't see what's on that to I complete this one. Is that normal.",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 9,
    "Question": "Hello all, long time lurker, first time poster. Probably because I'm mad as heck right now from running up against walls for three some years. So to the point- injured in Afghanistan 2011 deployment. Several ortho surgeries, phys ther, injections, PTSD, blah blah. Finally was diagnosed with mTBI in December 2013 after begging my PCM to put in the referral. While waiting to go to TBI three week class, was referred to medboard for Ortho with many addendums for asthma, PTSD, pain management, Neuro for TBI related migraines, etc. Been found unfit by Navy and package is sitting at Providence RI in review of evidence (I had to find all this out by myself- no help from PEBLO etc but I'm used to being proactive and doing this whole process by myself for the most part by now). Here's where it gets quite interesting. Went thru BTRIP at NMCP (TBI class), and learned from another member I should ask for an MRI as well as a screening for NED (Neuroendocrine Dysfunction), as well as a check on my Pineal gland. Went home and googled all these, turns out that RPG may have sheared some axons in the noggin, knocked around some important glands, etc. So I put that on my lengthy 'to-do' list, and kind of forget about it (insert TBI joke here). About three weeks ago, had some really annoying ankle pain from surgical site. Then the migraine started. Driving home, right hand starts slipping off wheel (I'm right hand dominant), license plates in front of me start getting blurry and floaty, fine motor skills are going quick. Call spouse, who tells me to go right to ER (civilian hospital was closest). Get in to ER, can barely form words- by the time they get me back BP is super high, can only answer intake questions by scrawling with left hand. Body goes stiff, then completely relaxes- no muscle tone at all. Awake and aware whole time! Rest and observation for about three hours, can start to slowly move, then carefully form words, then good to go. CT scan normal. Injection for original pain in ankle and migraine and off I go. Follow up with Neuro in two days, doc tells me it was anxiety, that I need to calm down. I ask for MRI, he says it won't show anything, I insist, he finally relents to 'make me feel better'. MRI results- 'Scattered T2 hyperintense foci in the subcortical white matter, right greater than left, non specific. There is a fluid filled structure in the region of the pineal gland, likely representing a pineal cyst which exerts a small amount of mass effect on the tectum. no corresponding hydrocephalus.\" I call the Neuro and he tells me this is why he didn't want to give me an MRI because these finding mean nothing. Well what do they mean? I ask and receive second opinion, have an appt with a Neurosurgeon in June. See my PCM for NED screening- results are : Adrenocorticotrophic Hormone/Corticotropin <1.1 (ref range is 7.2-63.3). Cortisol AM is 1.04 (ref range is 4.46-22.70). I was asked how I even get out of bed and function? \"it's just what we do\" I replied, because I don't have the answer myself. LESSON LEARNED- take the advice of those who have gone before! If I had perhaps I could have saved myself a year or two of misery? I'll keep this updated.\nThank you for this board- it's been a source of knowledge and empowerment!",
    "Response_1": "Go to your nearest VA Hospital and hit up the Dept of Rehabilitation, schedule an assessment with a Physiatrist. They will do a full TBI work up and create a rehabilitation plan. \n\nThis can be accomplished while you are still on active duty through Tricare.\n\nRehabilitation is the only successful way to 1.) assess all of you residual post-concussion deficits 2.) create a plan to improve quality of life regarding post-concussion deficits 3.) get everything documented for future treatment and compensation.",
    "Response_2": "I go through something very similar but not quite so severe as your case, my MRI I had in Kuwait came up clean. Though I do get these moments/periods of time where I can not operate correctly. Hard to make my body move, thought processes are very slow, stuttering, inability to complete sentences/words, hands unable to fully grasp things, headaches/migraines, some twitching which is very minor, sometimes the entire right side goes numb and tingly... My wife has to basically lead me around and feed me like baby, and watch everything I do while I have these episodes. I recently have been having an issue with typing with my right hand constantly and words come up all jumbled. About a quarter of the words in my reply have been deleted and retyped.\nWas the NED test off of the MRI or was it separate?",
    "Response_3": "Trust me, it is not a lot of red tape. There are case managers at the VA that will assist you with it.\n\nThe NICOE is a Military Dept of Care, however in my opinion, you will be better served by the VA.\n\nIf you want to chat offline, I can set you up with all of the steps I had to go through for mTBI treatment and each of the programs that benefitted me.\n\nWith the Army all I got was lies and attempts to discount or ignore my injuries.",
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 10,
    "Question": "I just found out I have a \"full\" audiology exam this Wednesday. They said normally it would just be an audiogram but since I have an LOD for TBI from my time in Afghanistan they want a full workup. \n\nWhat is a full audiology exam consist of?\n\nThanks everyone....I've been reading this site for awhile and will post my timeline soon.",
    "Response_1": "I'm pretty sure they do a full workup anytime you do a claim for something hearing related.\n\nSo part of it will be the basic test, what tones do you hear out of each ear. Then they will do a test to see how well you can recognize speech out of each ear. Then they do a couple physical tests with the ear to see how the equipment in there moves. That's what mine was, most thorough test I've done, but not sure if there is a more complete one.",
    "Response_2": "I just recently had one of these done, referred for TBI from Neurology. Did the normal hearing test with push button, then did some more testing which included some \"radar\" type stuff where I just sat there with some plugs in my ears, also checked occipital bone stuff and then some more hearing type stuff. The Audiologist then sat down, interpreted all the data, & come to find out, not only did I have the tinnitus, I also have mid & high range frequency loss. I'm still \"in the range\" for low frequency, albeit, it's not where it should be for my age (34). Low & behold, I now have hearing aids. Was told by Dr that hearing aids are covered by VA, but unless there is significant hearing loss (almost deaf), then the only compensation is for the tinnitus. Hey, I'm fine with that, at least I can hear better now!! Plus, I've got enough other crap going on to worry about.",
    "Response_3": "I have been reading a number of case where members have claimed hearing loss but got 0%. That worries me, I am completely deaf in one ear now and last June I lost hearing in my other ear for 2 days. I got some hearing back but not enough to function without hearing aides and even with those it is still hard to understand people. Has anyone ever received or know of anyone getting any percentage for single sided deafness, not to mention the constant tinnitus.",
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 11,
    "Question": "Has anyone been medically retired because of a TBI called Chiari I Malformation?\n\nI had a surgery called a Fossa Decompression and craniotomy of the base of my skull. My neurosurgeon also remove part of my C1 and C2 vertebrae.\n\nI have a lot of issues with this injury. My medical doctor offered to medically retire me at 30%, but I feel that is low. Just wondered if anyone out there has experienced this?",
    "Response_1": "Your doc responsible for treatment doesn't get to offer you a %.\n\nThe doc will decide if you need a permanent profile and what restrictions you need. While this is supposed to be an objective measure, often times it becomes a discussion between doc and you if you want to continue to serve. Once he writes up those restrictions to put you below retention standards, they will MEB you. At that point its not up to anyone but the PEB to keep you in or not. Its not up to anyone but the VA what rating you get.\n\nPart of this process is a separate doc coming in to determine your level of disability. It is a separate doc because it is supposed to be a very straight forward look at what you can and cannot do and completely ignores treatment options. Anything keeping you from serving will become a DoD rating, and anything else disabling will added in to become a VA rating.\n\nhttp://www.militarydisabilitymadeeasy.com/tbi.html\n\nGives a very good overview of the functional levels they look at for determining TBI ratings. Its a fairly long and complex read, even though I believe that's the best breakdown possible. TBI is a hard one because of how widely variable its effects can be. They basically take how well you function in a bunch of different areas and whichever one comes out worse, that's the rating. They will not factor in surgeries. They simply look at what you can do now that treatments have improved what they can.\n\nRating can be 0%, 10%, 40%, 70%, 100%. 30% isn't even an option. It may be possible to distinguish some symptoms from the TBI for separate ratings. What others have gotten ratings for may not speak accurately to what your ratings will be, there being a wide range of symptoms possible and different responses to the surgery.\n\nI would make sure they also profile you on the neck, not just the TBI. I imagine those two missing vertebrae are also causing troubles and are likely to also be unfit. You will also want to research CRSC I imagine.",
    "Response_2": "I hadn't heard of Chiari before so did a bit of research. Most state it is congenital, but you stated it was a TBI. It was noted most do not know they have Chiari until their 20s-30s or they have a head trauma which requires MRIs or other imaging at which time the Chiari's is diagnosed. Do you mind sharing more info?",
    "Response_3": "Chairi's means there is pressure around the movement area of the brain, brain stem area. It is normally something that you'd be born with, and over time a slight off from birth leads to problems. Congental being more common should be obvious because a slow skull problem being developed in fetus is easier to survive than a sudden injury to the skull that changes its structure.\n\nSounds like his tbi caused a skull injury that was causing over pressure and they attempted surgery to try to fix it.",
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 12,
    "Question": "I might be getting a meb soon for my constant headaches. Back in 2008 on a convoy I was blown up by an IED. After that I had a concussion and later diagnosed with mtbi. I had daily headaches and just felt out of it. I received hypobaric oxygen chamber treatments and my headaches almost all went away. Fast forward a few years and now I have the daily headaches once again. I have a headache log and take fioricet twice a day for pain. Daily brain fog is also present. I asked my pcm about a meb and he said we need an updated neuro surgeon opinion on being fit for duty. Any ideas on a rating for daily migraine type headaches? I've been in for 10 years AD.",
    "Response_1": "Indeed and you are welcome! :)\n\nAs such, good deal with seeing a neuopsych for continued behavioral healthcare treatment. Take care! :cool:\n\nThus, I quite often comment that \"possessing well-informed knowledge is truly a powerful equalizer.\"\n\nBest Wishes!",
    "Response_2": "Indeed, and okay; for sure, the details are in the results! ;)\n\nThus, I quite often comment that \"possessing well-informed knowledge is truly a powerful equalizer.\"\n\nBest Wishes!",
    "Response_3": "Skip the Neurologist and Neuropsych, they are in the good old boys club with the hospital commander.\n\nSeek out a Physiatrist, they are doctors of rehabilitative medicine, they will do the correct analysis to diagnose post concussive syndrome (residuals of TBI)",
    "Response_4": "Well, from my experiences, it seems that the civilian physician who wrote the results is the primary individual who can ultimately change their own feedback unfortunately.\n\nThat said, your PCM, patient advocate and/or the civilian physician's boss can only lend potential assistance in your quest to have the report changed from my experiences with civilian healthcare providers. \n\nMoreover, at a minimum, you can request to have a statement added onto the civilian physician's medical report so that others shall be able to read your objections to certain statements within the medical report in question. \n\nNonetheless, please don't give in; keep up the positive proactive measures to ensure receipt of your desired expectations. Take care!\n\nThus, I quite often comment that \"possessing well-informed knowledge is truly a powerful equalizer.\"\n\nBest Wishes!",
    "Response_5": "All right, good deal; this is very good news to hear that the physician was willing to revised his medical report! :)\n\nIndeed, in retrospect, the new DSM-V criteria now recognizes Post Concussion Syndrome (e.g., ICD-10 code: Postconcussional syndrome - F07.2) as an acceptable mental health disorder albeit unfortunately I have not seen any official policy documentation from the USDoVA mandating its use to the Veterans Benefits Administration (VBA) (e.g., D-RAS rating evaluations) and Veterans Health Administration (VHA) (e.g., C&P examinations/evaluations).\n\nWith that said and at least from my experiences within the DoD IDES MEB/PEB process, if there doesn't exist an official Traumatic Brain Injury (TBI) diagnosis and/or the MRI documentation doesn't show physical evidence of a TBI, then you may have issues with the MEB physician during NARSUM dictation and/or the DoVA C&P Examination in Neurology for an official TBI diagnosis.\n\nIn my opinion, the bottom line is without an official TBI diagnosis tends to result in a �Proposed DES Not Service Connected, No Diagnosis� evaluation by the DoVA D-RAS in reference to VASRD code �8045 Residuals of traumatic brain injury (TBI)� since Post Concussion Syndrome or Post Concussive Syndrome isn�t recognized within the old DSM-IV.\n\nNonetheless, please continue to move onward and don't give in if this occurs. As such, keep up the positive proactive measures to ensure receipt of your desired expectations while in the DoD IDES process. Take care!\n\nThus, I quite often comment that \"possessing well-informed knowledge is truly a powerful equalizer.\"\n\nBest Wishes!"
  },
  {
    "Question_id": 13,
    "Question": "As it stands, I am 80% SC for\n\nAnxiety-50%\nIBS-30%\nTinnitus-10%\nDDD-10%\nOSA-Still fighting it\nUrinary Incontinence- Still fighting it\nNow this is where I am not sure how to proceed with my current issues. I have had blurry vision since being active duty (documented in service). I recently had a VA Optometry appointment and at the end of the exam she asked me when I had a TBI? I said I hit hard when doing jumps (82nd Airborne Division) and I was awarded a Combat Action Bade for being so close to multiple rocket/mortar explosions (less than 20 meters).\nI was never knocked unconscious, but I did see stars on some on my jumps and I felt the blasts on my body which felt like someone shoving me, but that was it.\nWell, I was diagnosed with Divergence Insufficiency, given Prism glasses and told I needed to see an eye physical therapist.\nI went last week and more stuff happened!\nMy eyes were dilated to the point that the Dr couldn�t tell what color my eyes were (Mydrasis)\nSecondly, while doing exercises my eyes would twitch side to side (Nystagmus)\nAny thoughts on how to file this through the VA for service connection?",
    "Response_1": "Occular impairment as a result of TBI, you will be referred to a specialist for a TBI evaluation. Most of your impairments sound physcial at the moment. Are you having difficulty concentrating? The tinnitus could also be linked to the TBI as I have ringing in my ears at times. They did not diagnose me with tinnitus, just mTBI (risiduals from multiple concussions). I see you are fighting OSA. Have you had a complete sleep study? Outside the VA, they are about 2 grand... I had one and it turns out I have mixed apnea. Some times I have obstructions due to weight and sometimes, like during my last infusion I will just kinda daze out into space and not breath. I snapped to when the machine started beeping and flashing blue because I wasn't breathing. Freaked me out. File again and let us know how it goes. I am at 40% for my knee and Crohns but am pending a claim for anxiety, depression, sleep disturbances, migraines, arthralgia, surgury risiduals (tonsils), sleep apnea, and mTBI. They tried lumping the anxiety, depression, sleep disturbances, and insomnia as PTSD. I told them that while I meet the secondary requirements on the Mississipi scale and all requirements under DSM IV and DSM 5 that I do not believe I have PTSD as a result of combat. Might have it from drowning as a kid, but not combat. I don't want to be given anything that I am entitled to even if it appears I would be. When I get nightmares and cold sweats because of overseas... then I will apply. Already getting aggitated with the news lately so... who knows... Lost my cousin due to PTSD. We both just got back home and he ended up drinking after a fight and sped off. His truck went off road. That is one of the reasons I don't think I have PTSD.",
    "Response_2": "Lucky for me, mine was documented. I have no idea what I got in Kuwait but something let my tonsils swell up so bad, I was on 4 different antibiotics and nothing worked so they cut them out and annotated chronic tonsilitis, enlarged uvula, and OSA. Were you ever in a barracks? If you were in a barrack or... took a nap somewhere and had a buddy mention you snored, get him to write up a sworn statement. You can't have OSA without snoring. Now if you had a complete sleep study (I mean you get to the place at 5pm, they hook you up to a billion wires at 7pm, get a baseline at 8pm, have you sleep till 2 am, then you get the CPAP for the remaining hours until you are up or 6am... and observe you till 10am), see if you have a read that is completely blank. Obstructions show a partial air intake. I had 43 seconds where I wasn't breathing at one point which is why they say I have mixed apnea. CPAP does nothing for me because I have a major blockage in my septum, so I am just waiting on the surgery for that to be fixed. Definately file for TBI and occular impairments. Worst case, they say no and you appeal. I HIGHLY doubt though, that you would be denied based on what you have said. Not sure about urinary incontinence... where were you deployed to and when did it begin? Did you ever have MMR vaccine as a child or did you have actual measels? Measels can cause some incontence as you get older which can also make you legally infertile due to creating an enlarged vein.",
    "Response_3": "Definately work on the appeal and bring the statements up to your PC. You might be able to get the PC to write something that states that based on the statements your symptoms were present while on active duty. I had to have my surgical records and three GI doctors state that my Crohn's symptoms begain on active duty in order for my claim to be approved even though I was not diagnosed until after I came off orders. If you have a good relationship with your PC or have a good civilian doctor, I would try to get the doctor to write something for the appeal. The plus side to appeals from my research, they take a second look at the buddy statements and duty locations. Definately work on the claim for TBI. Get as much as you can gather, include the recent eye impairments, and just the TBI and eye impairment alone will have you rounded to 100%.",
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 14,
    "Question": "If I went through the Second Level TBI and was diagnosed with TBI w/ loss of consciousness and I have been scheduled for Insomnia class, Organizational Class, Physical Therapy and TBI Vision will I have to go to C&P for TBI?\n\nAlso, if I have been diagnosed and treated for Depression and Anxiety since 2011 will I have to go to C&P?\n\nReason I ask is my claim went from gathering evidence to Decision Pending Approval and no C&P has been scheduled.\n\nAlso, someone said with all of those items that I could possibly expect 30-50%? Thoughts?\n\nThank you so much for taking the time to read",
    "Response_1": "Hmm, have you been officially referred to the DoD IDES and accepted into the DoD IDES PEB/MEB process?\n\nThus, I quite often comment that \"possessing well-informed knowledge is truly a powerful equalizer.\"\n\nBest Wishes!",
    "Response_2": "that's potentially the case since the PEB Forum is primarily focus to provide assistance for military service members (e.g., Active Component and Reserve Component) who are referred or being referred into the DoD IDES MEB/PEB process.\n\nTo that extent and consistent with lending assistance to military veterans, I would suggest that you contact the DoVA customer service toll-free number at 1-800-827-1000 for additional assistance to your direct questions or submit an IRIS inquiry at the following URL:\n\nhttps://iris.custhelp.com/app/ask/session/L3RpbWUvMTM3NjQyNzA0MS9zaWQveHZrOXRIeGw%3D \n\nNonetheless, please continue you quest for answers until receipt of feedback satisfactory to your expectations. Take care!",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 15,
    "Question": "Just finished my 2nd Level Evaluation for TBI and these two items stuck out to me\n\n27) Are the history of the injury and course of clinical symptoms consistent with\na diagnosis of TBI sustained during OEF/OIF deployment?\nNo\n28) In your clinical judgment the current clinical symptom presentation is most\nconsistent with:\nA combination of OEF/OIF deployment related TBI and Behavioral Health\ncondition(s)\n\nI read through myhealthyvet and the Dr. Listed me as having TBI with loss of consciousness and anxiety and depression.\n\nI have an open claim for TBI due to MVA (New), Residuals of TBI (New), and anxiety (New). I am currently at 30% for my back and wrists.\n\nI am wondering if anyone has any insight on this evaluation and what I could possibly expect and what I should look for... No C&P has been done, but I have been moved to PENDING DECISION APPROVAL.\n\nClaim has been since 3/20/13\n\nThank you for your help",
    "Response_1": "BH claims are not combined with TBI, however in my situation the C&P BH provider did my TBI assessment.\n\nThere are 10 facets of cognitive impairment that are assessed, based upon the residuals during the assessment, a statement is made that typically correlates with the rating percentage.\n\nHere is a link to the rating criteria: http://www.benefits.va.gov/WARMS/docs/regs/38cfr/bookc/part4/s4_124a.doc\n\nThere is a possibility that during the C&P evaluation that the residuals you currently have are not properly assessed, if this happens to you and the rating is not what you would have expected due to your medical history, then you would need to do a VARR.\n\nThis is why, in my opinion, you need to read and understand the rating criteria for each and every single referred and claimed condition, request a copy of your C&P evaluation as soon as it is ready, then pre-rate your own conditions based upon the C&P. \n\nIf the C&P does not have enough information, or the correct information that you should get based upon your medical history, then you should put together all of the records you have to prove otherwise.\n\nI do not know about other service members, but I am 100% confident in my own DRAS VA rating, not one document other than my C&P evaluation was looked at during the process.",
    "Response_2": "my guess is they combined a current depression/anxiety condition with previous damage done via TBI. I would say it will be rated, but I wouldnt count on above 50% and likely 30% depending on your current condition physically and work wise sleep wise family wise etc.",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 16,
    "Question": "AFTER I CAME BACK FROM AFGHANISTAN I SUMMIT A VA CLAIM FOR PTSD,DDD L BACK PAIN,LOWER EXTREMITIES NEUROPATHY. AND IT CAME BACK GRANTED 70%,20%,10%,10%,=80 COMBINED AWARD DATE 01/20/2012 NOTE I AM IN VA/DOD IDES\n\nTODAY 09/28/2013 AWARD LETTER DECISION OFFICIAL NOT PROPOSED: PTSD 70%,CLUSTER HEADACHES,RESIDUAL OF TBI 30%, INTERVERTEBRAL DISC SYNDROME 20%, BILATERAL LOWER EXTREMITIES NEUROPATHY R 10%,L 10%,FRONTAL SCALP SCAR SECONDARY TO TRAUMA 10%,UPPER EXTREMITY HAND DOMINANT NEUROPATHY 10%\nDECISION:\n1.FOR DISABILITY EVALUATION SYSTEM PURPOSES,AN EVALUATION OF 70% IS PROPOSED FOR (PTSD) WITH COGNITIVE IMPAIRMENT, RESIDUAL OF (TBI) EVALUATION OF (PTSD) WITH COGNITIVE IMPAIRMENT,RESIDUAL OF (TBI) (ALSO CLAIM AS DIZZINESS) (PREVIOUSLY DENIED AS MAJOR DEPRESSION WITH SLEEP DISTURBANCE AND MEMORY LOSS),WHICH IS CURRENTLY 70% DISABLING,IS CONTINUED.\n\nWHAT IN THE HELL IS THAT MEANS ?",
    "Response_1": "Bottom line is that since your PTSD and residuals of TBI symptomatology can not be separately identified, the DoVA D-RAS has assigned a 70% rating under the PTSD medical condition.\n\nIn my opinion, if it's later determined by medical clinicians that the overlapping symptomatology can be identified separately to PTSD and residuals of TBI, then a separate PTSD and separate residuals of TBI ratings could potentially be assigned.\n\nThus, I quite often comment that \"possessing well-informed knowledge is truly a powerful equalizer.\"\n\nBest Wishes!",
    "Response_2": "I went through a little bit of a similar case, they said they couldn't diagnose me correctly on the PTSD and TBI because of the cognitive issues. The only way we could differentiate the two is that when my brain hurts, I get stupid. I get \"retarded\" moments for hours to days. They go away and not be present for days, weeks, and months. They hit me pretty randomly and I have not found a cause for it yet.\n\nI would go in for testing in BH on the \"retarded\" days and go see neuropsychology and speech therapy. I would go to those offices on normal days and take the same tests again. I eventually proved that I do have 2 very different cognitive issues and they are dependent off of each diagnosis.\n\nIf you have something similar to my case, I'd suggest looking into it!\n\nFYI people, do not get insulted when I say \"retarded\" moments. My brain hurts during these times, I cannot think straight, I mumble, stutter, slur words, I can barely wipe my own butt, walk, type on a computer and so on. It is the only way I can describe it...",
    "Response_3": "no insults here and I concur with your feedback! ;) -> :(\n\nTo that extent, I need to follow your sound advice to get my currently non-TBI diagnosis by the DoVA changed to an official Residuals of TBI diagnosis or at least to the Post-Concussive Syndrome (PCS) new diagnosis via the new DSM-V mental health criteria.\n\nAt the end of the day, I just want to be properly evaluated by the DoVA C&P Examination clinician; therefore, properly rated by the DoVA D-RAS in turn, too!",
    "Response_4": "the DoVA C&P Examination clinicians should have the capability to address your PTSD and residuals of TBI medical conditions. Apparently, they are having challenges with positively identifying the separation symptomatology of your medical conditions due to overlapping.\n\nTo that extent, please continue to address your concern(s) to potentially yield a separation of medical diagnosis for PTSD and residuals of TBI. Good start with good research for similar case symptomatology. Keep it up! ;)\n\nBottom line is if you don't properly address your medical condition concerns via a DoVA appeal, who will?",
    "Response_5": 0
  },
  {
    "Question_id": 17,
    "Question": "It has been a while since I posted- since posting last, my husband was medically retired, and has received a combined rating of 90% from the VA as follows:\n\n70% PTSD\n40% DDD with chronic pain s/p surgery\n30% TBI with migraine headaches\n10% right knee\n10% right shoulder\n\n\nSo- here is the deal:\nMy husband received his original rating last September- without a rating for the migraines. (they said they needed further review). Today, one year later, we receive the final rating decision of \"30% TBI with migraine headaches\".\nIn a separate envelope he received a letter stating that \"he has an appointment scheduled with a \"private medical facility\" to determine your current level of disability\".\nWhen we called the VA the Customer Service Rep said this appointment was to determine if the TBI diagnosis needs to be evaluated separately from the migraines. However, it does not say what this appointment is for in the letter.\nWondering if anybody else has experience with this, and if this will \"hurt\" his rating?\nIs this normal procedure?\nAnyone know what to expect at this \"private medical facility\" appointment, and why he isn't evaluated at the VA hospital (we do have a big VA here in Spokane, WA).\nIs this really \"just\" for the TBI/migraines?",
    "Response_1": "In my opinion, the DoVA D-RAS is performing a good practice via VASRD by ensuring that the TBI and migraine headaches could potentially receive separate DoVA ratings.\n\nIndeed, it continues to be a stressful event with being on TDRL, but the potential disability compensation benefits shall hopefully out weigh all concerns upon official determine of a PDRL finding; you all can do it! :)",
    "Response_2": "No worries, it really doesn't matter where you post something. If you post anything it will show up under the FORUMS tab then NEW POSTS tab!",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 18,
    "Question": "I HAVE A CLAIM FOR TBI TO INCLUDE COGNITIVE DEFECTS , LOOKING IN MY SMR I FOUND A LANDSTUHL GERMANY,DEPLOYED WARRIOR MEDICAL MANAGEMENT CENTER ,LSL NEUROLOGY CLINIC A STANDARD FORM 600 CONTAINING A CONCUSSION SCREENING VERSION 1 \nSTATE: PATIENT SCREEN NEGATIVE FOR CONCUSSION.PATIENT HAS BEEN EXPOSED TO AN EVENT DURING HIS CURRENT DEPLOYMENT ; HOWEVER, PATIENT DENIES HAVING EXPERIENCEDANY ALTERATION OF CONSCIOUSNESS FROM THE EVENT ( SEE COMMENTS FOR NUMBER AND TYPES OF EVENTS )\n\nQUESTION NOTE: 1 BLAST,FALL OUT OF TRUCK HIT HEAD DURING A FIREFIGHT,\n\nI HAVE MANY DOCUMENTS LIKE; PATIENT MOVEMENT RECORDS AF IMT 3899 AND LOD STATING THE SAME ALSO INCLUDED IN IDES NARSUM\n\nMY QUESTION IS : I DEVELOP THE TBI SYMPTOMS FEW MONTHS LATER AFTER DISCHARGE FROM AD THE SYMPTOMS BECOME WORSE GRADUALLY UNTIL THE TIME I REACH FOR HELP AT THE LOCAL VA HOSPITAL TODAY I AM MORE STABLE BUT DEALING WITH COGNITIVE PROBLEMS AND STILL IN MEDICAL CARE FOR THOSE PROBLEMS, PTSD AND MANY MORE. IS POSSIBLE THAT VA DENIED MY CLAIM FOR TBI NOTICING WHAT IS IN THAT SCREENING?",
    "Response_1": "You need to go see a VSO and get them to have the VA do a reconsideration on your TBI claim, especially if it is getting worse. I know that taking medications can make TBI symptoms come out fully or make them seem like they are presenting themselves. Talk with your PCM about the issues presenting currently with your TBI, even though it wasn't rated, it is still there and can be treated and can be beneficial to you to start seeking treatment through the VA now. Even though you may be charged for it, you still have TriCare to help with this.\n\nYou are also in luck with that you are less than 1 year out from your ETS. This will make your claim process MUCH faster. Start now so you don't have to wait longer!!!",
    "Response_2": "Your Dr. is exactly right. Listen the the above advice, get a good VSO, and get all of the new documentation in. The VA looks at documentation - they aren't medical experts, and base their decisions on what the law and the documentation states. It sounds like you have more thorough documentation now, so you should certainly submit it. Best of luck",
    "Response_3": "yes this is true. 6 years after my second TBI I am having another issue starting to present it's self, I am starting to stutter a little and having issues getting a word out of my mouth every once in a while. It's a small thing, but big enough to notice by others and myself",
    "Response_4": "In addition, PCS is non-existent as a medical diagnosis in the DSM-IV, but PCS now is a medical diagnosis in the DSM-V. This means that if your symptomatology is supportive of a mTBI or TBI medical diagnosis then it is what it is.\n\nTo that extent, if your symptomatology is supportive of a PCS diagnosis then you are potentially good to go at this point in time; just continue to visit your PCM for official documentation, medical treatment, and potential medical diagnosis.\n\nIn retrospect, my mTBI and PCS symptomatology continues to become worse and I am most definitely ensuring that it's being officially documented while seeking the necessary medical treatment.\n\nRemember, this is just my unfortunate experiences but I shall hope that you have much better success with the DoVA; please remain positively proactive which goes a long way for eventual favorable results.\n\nAs such, a DoVA rating should not be based upon a medical diagnosis but it would definitely confirm the symptomatology of a medical condition to aide in a potential DoVA percentage evaluation in my opinion.",
    "Response_5": 0
  },
  {
    "Question_id": 19,
    "Question": "MEMORY=3\nJUDGMENT=0\nSOCIAL INTERACTION=3\nORIENTATION=0\nMOTOR ACTIVITY=2\nVISUAL SPATIAL=1\nSUBJECTIVE=1\nNEURO BEHAVIORAL=2\nCOMMUNICATION=0\nCONSCIOUSNESS=3\n\nANY GUESS ON POSSIBLE % THANK YOU",
    "Response_1": "In accordance with e-CFR, Title 38, Part 4, Subpart B, 4.124a, 8045 Residuals of traumatic brain injury (TBI), the Evaluation of Cognitive Impairment and Subjective Symptoms is annotated as follows:\n\n\"The table titled �Evaluation of Cognitive Impairment and Other Residuals of TBI Not Otherwise Classified� contains 10 important facets of TBI related to cognitive impairment and subjective symptoms. It provides criteria for levels of impairment for each facet, as appropriate, ranging from 0 to 3, and a 5th level, the highest level of impairment, labeled �total.� However, not every facet has every level of severity. The Consciousness facet, for example, does not provide for an impairment level other than �total,� since any level of impaired consciousness would be totally disabling. Assign a 100-percent evaluation if �total� is the level of evaluation for one or more facets. If no facet is evaluated as �total,� assign the overall percentage evaluation based on the level of the highest facet as follows: 0 = 0 percent; 1 = 10 percent; 2 = 40 percent; and 3 = 70 percent. For example, assign a 70 percent evaluation if 3 is the highest level of evaluation for any facet.\"\n\nAs such, in response to your specific inquiry, a potential DoVA D-RAS rating would be 70% due to an evaluation of \"3\" given for Memory, Social Interaction, or Consciousness facets.\n\nMoreover, albeit the Social Interaction facet yielded the highest level of evaluation, per the aforementioned regulatory requirement, the assignment of a 70% evaluation is mandated and not a 100% total evaluation.",
    "Response_2": "No worries, even with the lower Consciousness facet level of evaluation; your overall potential DoVA D-RAS rating would still be 70% due to an evaluation of \"3\" given in Memory, or Social Interaction for VASRD code 8045 Residuals of traumatic brain injury (TBI).",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 20,
    "Question": "I've been keeping a low profile on the forums, just posting my updates on the IDES experience at my base. I need some help, though.\n\nI've had four major concussions in my career. The last two were a direct result of a back injury that caused numbing in my right leg. Because I couldn't feel my leg/foot, I fell off my bike during a long ride and cracked my helmet in three places from the fall. The last concussion was slipping on ice and cracking the back of my head. Since the bike ride, I've had moments of confusion and light sensitivity. \n\nThis last one, however, has me in a bad way. \n\nI have been diagnosed with complicated migraines. These migraines are like a stroke in symptoms: overall body twitches, convulsions, paralyzation of the left side of my face, weakness in the right side of my body, incredible head pain, loss of coherency (and sometimes speech), stuttering when I can speak, and memory loss. \n\nI've been in the ER for these migraines six times in the past two months. This last one lasted four days and two ER visits before they could get it under control. Every episode is lasting longer with more impact to my memory. This time I couldn't remember the month, the day, or that my son had tried to call 911 during the episode. \n\nI keep trying to get neurology to do something, but they keep giving me \"preventative\" care that isn't working. TBI has been very adamant about keeping my stress down and following all care protocol. Does anyone have any experience with these issues? To tell you the truth, it's pretty terrifying for me and my family. Any help would be awesome.",
    "Response_1": "I have almost the same problem except for the confusion and twitches. I have been dealing with these issues since January so I really feel for you. You just have to keep after them keep going to the ER even if it is mild migraine. The TBI clinic does not care they just want to get you out of there hair. You have to take care of yourself and keep bitching and just go to sick call every morning and be a pain in the ass. Always remember the greasiest wheel gets the grease and if that don't work your senator will. That is if you can take the backlash from ur chain of command. If at all possible talk to ur chain of command and see if they can put some pressure on your PCM. I still have yet to see the headache specialist or really get any relief from these damm migraines. The best advice I can give you is just do not trust the doctors at MTF they really don't have your best interest in mind. Most of them are just PA trying to act like Doctors. My TBI doctor/PA didn't even know what a M107 Barret Sniper Rifle was. I told him my story and he was like how did you carry a 50 cal up the side of a mountain those things are like 250lbs with the tripod. Did you guys take it apart or what, I just sat there in disbelief because I didn't think you could be in the military much less be a man and watched any kind of action movie and not know what that gun looks like . Just make sure you everything documented and you look at ur medical records for that visit. I had one doctor put I was here for a gynecology exam.\nINCOMPETENCE AT IT'S BEST. Good luck to you.",
    "Response_2": "I can relate to your problem and know from experience that the longer you wait, the more the damage builds. If you don't mind, I'm not getting any answers to my problem and request for guidance. If I could here please.\n\nQuestion: 10 yr. vet PDRL with 50% VA rating granted 19 years ago. I continued to have a degrade in my mental faculties over the years to the point I couldn't get a single sight picture, my hearing degraded to the point of all sounds were noise that couldn't be discerned, and the depression/anxiety/comprehension skills all declined to the point I needed brain surgery X 2 to relieve the pressure for the TBI. I was told by a VA clinic that I should get re-evaluated since there were major indications for PTSD and the two brain surgeries warranted a relook into my case. Long story short, the re-evaluation by the psychologist revealed an interesting point which brings me to my question. During the evaluation, he spoke up and stated he'll write up the fact the TBI was misdiagnosed as a conversion disorder even though the prognosis revealed TBI by the first Psychologist. I perked up and said...what? He said, yeah, he indicated TBI in his diagnosis but the PEB write-up indicated conversion disorder. I'm not sure what to think on this, mis-diagnosed and evaluated by the board with a lesser condition is sending up huge warning flares in my mind. I need some guidance/advice. Any help is welcomed. The recovery is making this too complicated to sort out in my mind and need help. Thank-you ahead of time for any help.",
    "Response_3": "we'll I have 3 different types of migraines. The first one I had was just like a stroke. Was in the hospital for 7 days with seizure like shakes on my left side. The gave me blood thinners but nothing would stop them, After they finally stopped I was able to go home. I have aura, complicated and one other kind of migraines. I get them several times a month and it is just like a stroke every time. Have a hard time speaking or understanding things. I am very confused and speak very slow and walk slow. It's strange and very scary....it's comforting to know I am not alone. Kim",
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 21,
    "Question": "I have Chronic pain as one of my unfit issues. I was wondering if anyone else had this? and what the outcome was?\nI keep thinking unfit... I mean doesn't meet retention it's headed up to PEB as we Speek. I jut wonder when it goes to VA what it could be rated as",
    "Response_1": "It could be rated under CPS or under fibro, and i believe will be based on incapacitating episodes.\nfrom vasrd\n5025 Fibromyalgia (fibrositis, primary fibromyalgia syndrome) \nWith widespread musculoskeletal pain and tender points, with or without associated fatigue, sleep disturbance, stiffness, paresthesias, headache, irritable bowel symptoms, depression, anxiety, or Raynaud's-like symptoms: \nThat are constant, or nearly so, and refractory to therapy 40\nThat are episodic, with exacerbations often precipitated by environmental or emotional stress or by overexertion, but that are present more than one-third of the time 20\nThat require continuous medication for control 10",
    "Response_2": 0,
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 22,
    "Question": "Tommorrow I have neuropsych testing. What should I expect from this from those of you who have had it done? Also, is this going to be an addendum as well?",
    "Response_1": "Ive had 4 done and they cant find a baseline.. they refused to give me TBI b/c of no baseline. Ive had 4 mTBIs during last tour and cant concentrate and horrible memory. When I take the test, they always tell me, \"times up\" and I am just getting into it. So I had to have my Psychiatrist write a memo since he had given hundreds in his career and the hospital was trying to screw me. Hope you did okay.",
    "Response_2": "Is your Neuropsych testing with the Army or the VA C&P? I have had several evaluations and the testing is always the same, however the results are interpreted very differently by the Army Doctors than the VA or Civilian.",
    "Response_3": "Hum, looks like I need to visit the TBI center on Camp Lejeune; there is one small concern...I am not a marine. :( \n\nMoreover, I just want a validated TBI/mTBI/PCS neurological medical condition diagnosis so that a proper treatment plan can be formulated. It's not fun having a memory that is \"shot\" and written reminders (with my wife and now kids) have become the primary method to perform the tasks of activities of daily living.",
    "Response_4": "Well, the Marine Corps way seems to work...they get the results! :)\n\nOh, yes! This probably would have been a good time for another joint military assignment. Current neuropsychological testing stands at 50% complete, but it was post-poned indefinitely due to the recent death of my BH neuro-psychologist; his replacement is being advertised for Government hire. \n\nMoreover, the Army didn't even refer me to the TBI Clinic at WRNMMC; not severe enough but define \"severe\" other than the obvious TBI case(s) via MRI examination validation.\n\nThus, appreciate the detailed feedback; I am now well versed unofficially about the Navy and Marine Corps Concussion Recovery Program.",
    "Response_5": 0
  },
  {
    "Question_id": 23,
    "Question": "Apparently, a new Directive Type Memo on Management of TBI has been published. It seems to be a \"controlled\" document. \n\nHere is the link: http://www.dtic.mil/whs/directives/corres/pdf/DTM-09-033_placeholder.pdf\n\nI am not sure if it requires a CAC card to access, but if anyone has access to this and it is not classified (can't imagine that it could be), would you mind either posting it or sending it to me so I can post?",
    "Response_1": "I had 1 mTBI - LOC in 2009 and 3 mTBIs during my 2011 AFG deployment with 1 LOC and spent weeks/months in the mTBI clinic and hospital before being flown home to the WTB. I've failed/had inclusive results on my Neuro Psych test 3 times and the Army thinks I am bullshitting when I am giving it 100%. I have so many sworn statements on what I was like before and after the concussions to prove it and the SIGACT report plus all the Purple Hearts to prove it. Bottom line - They still find me \"Fit for Duty\" on my 3947. I appealed 3 times and my IMR agreed to have me unfit but the DR still found me fit for all the 4 mTBIs I have had. I never signed my NARSUM or anything and they sent it to FT Lewis. Not sure what else to do b/c everyone that knows me cant believe they want to give me unfit on my 3947. Even the Brigade Surgeon said one more concussion and that might be the end of me. Pretty messed up.. What can I do???",
    "Response_2": "Required reporting is a good idea to solve the problems with lack of documentation. Too bad this was dated 4 days after my injury. I don't think my ship ever made any official reports outside of my follow ups in medical.",
    "Response_3": "Good luck on getting the 7652. I have tried through PEBLO, jag and everyone else. They say I'm not allowed to look at it. I will get a copy when my 199 comes and I haven't even been found fit/unfit yet.",
    "Response_4": "At this point, you have to see what the IPEB says. While the NARSUM and 3947 is strong evidence, the PEB does not always follow what these documents say.\n\nWhat does the Commander's Functional statement say about your ability to perform your duties?",
    "Response_5": 0
  },
  {
    "Question_id": 24,
    "Question": "I receive a my DA form 3947 and have various condition listed PTSD,DDD,LOWER ESTREMITIES NEUROPATHY.\nbut found my TBI meet retention standards.physical examination Diagnosis is : For the claimant's claimed condition of TBI the the diagnosis is traumatic brain injury, based on the history of a specific head injury/the condition is mild. the subjective factors are memory loss difficulty concentrating. the objective factors are normal mental status. recurrent headaches the diagnosis is Cluster headaches. The subjective factor are recurrent throbbing headaches W radiation. the objective factors are None. The claimant's head injury can be classified as a \"Diffuse axonal injury\". It should be noted that the head injury has established. in regard to where the TBI was sustained it was during service . The claimants has the following as a result of the head injury : Post concussive symptoms. the diagnosis is TBI/no positive imaging studies. this is due to service related TBI ,Cluster headaches the diagnosis is as described. this is due to the service related TBI, Neurological problems. the diagnosis is peripheral neuropathy. this not due to the service related TBI . there is neuropathy in the upper extremities. there is neuropathy in the lower extremities. physical examination\n\nMental examination for PTSD also include a TBI Assessment and (MOCA) Test and ten facets of cognitive screening the DR. found moderate problems in the area of :Memory,Attention,Concentration,social interaction,visual spatial orientation occasionally get lost in unfamiliar surroundings,subjective symptoms daily head aches frequent insomnia and hypersensitivity to light , Neurobehavorial effects verbal aggression,physical aggression and irritability",
    "Response_1": "it's all good!:)\n\nFrom my experiences, your TBI diagnosis as written on the DA Form 3947 is fairly descriptive than most I have been given the opportunity to review. If you are an Army Active Duty service member, I pose the following questions:\n\nQ1: What medical conditions were annotated in Section 1 on the Physical Profile, DA Form 3349?\nQ2: What was initially submitted in \"Section 3: PULHES\" on the Physical Profile, DA Form 3349?\nQ3: Did your behavioral health provide include a statement referencing their strong support of a \"S3\" permanent profile on the Physical Profile, DA Form 3349?\nQ4: Did you complete a series of Neurophysiological testing prior to the completion of the DA Form 3947?\n\nMoreover, PTSD and TBI are rated separately as annotated on the VASRD. You were diagnosed with \"PTSD\" and \"TBI/no positive imaging studies\" separately which are military service-connected medical conditions. In turn, your \"PTSD\" and \"DDD low back\" diagnoses were found \"medically unacceptable\" as based upon the strong objective evidence within your medical records.\n\nIn my opinion, stand-alone cognitive screening results are not strong enough evidence to completely show a demonstrated objective cognitive impairment which may yield a \"medically unacceptable\" determination.\n\nTherefore, I offer that you evoke your opportunity to voice your strong opinion referencing the TBI diagnosis not being a \"medically unacceptable\" determination. That said, you should immediate contact Legal Service for advice on how to proceed (i.e., submittal of an IMR and/or MEB Soldier's Appeal) with your options while a member in the DoD IDES MEB/PEB process.",
    "Response_2": "I had the same issue, my doc explained it to me the TBI itself isnt unfitting but what you can get listed as unfitting are the issues that you have from the tbi neurocog deficits, migraines all that good stuff. I got tbi fitting but all the rest unfitting and went to fort sam and saw the chief of neuro psych and got tested and documented to back it up",
    "Response_3": "A TBI is rated by DoVA as 0% to establish military service-connection. But, the residuals of that TBI are rated within the VASRD as \"TBI with residuals.\"\n\nMoreover, if a military veteran has strong objective evidence in support of neuropsychological testing and/or positive medical imaging (i.e., MRI, CT scan, etc.), then the ten TBI facets within the \"TBI with residuals\" shall be evaluated for a potential diagnosis and corresponding DoVA rating.",
    "Response_4": "Appreciate the historical background IDES case information. \n\nBased upon the information you have provided, my assumption is confirmed about stand-alone cognitive screening results are not strong enough evidence to completely show a demonstrated objective cognitive impairment which may yield a \"medically unacceptable\" determination.\n\nYou mentioned that \"Neurophysiological testing only one at va poly clinic resulted inconclusive due PTSD...\" which means that the results were not evident enough to determine a separate objective TBI diagnosis because of your strong PTSD symptomology. \n\nIn these cases, the mental health examiner/clinician made the determination that all of your TBI-like residuals (i.e., cluster headaches, and cognitive impairments) were caused by your PTSD which explains to me the 70% DoVA rating. The VASRD states if objective evidence is strongly available to rate your TBI residuals separately, and then an individual evaluation for a diagnosis should be completed. I believe that this requirement is advantageous for the military veteran, but some veteran advocates have strong non-supportive opinions. \n\nTherefore, I continue to offer that you evoke your opportunity to voice your strong opinion referencing the TBI diagnosis not being a \"medically unacceptable\" determination. That said, you should immediate contact Legal Service for advice on how to proceed (i.e., submittal of an IMR and/or MEB Soldier's Appeal) in reference to your options while a member in the DoD IDES MEB/PEB process.",
    "Response_5": 0
  },
  {
    "Question_id": 25,
    "Question": "So I just had my TBI C&P and I left there really confused. I went into it knowing that the VA would be looking hard at this due to a motobike wreck I was in a few years ago but I wasn't really expecting this. I left feeling very confused and feeling like there may actually be something wrong that came out of that but I don't know what it is. When she said we were done I told her I didn't know what had just happened and that I wanted to know what her diagnosis was. She started acting like I had amnesia and very abruptly told me the current date, her name and that I was there for a evaluation. I knew all that - I just wanted her diagnosis because I was very confused. When I pushed again for her diagnosis she said \"this is the point where I tell you to follow up with your PCM and talk to a Neuro person at your base\"\n\nWhat the heck is going on here? I'm really lost at this point. Going to try and get her report from the records section before I leave but I'm going into the weekend pretty stressed out over the whole situation.",
    "Response_1": "The examiner is not suppose to discuss the findings with you by direction. Once it's actually written up you can request a copy of the C&P from the VA, which you would want to do anyway with all your C&P exams if you have any more. It's your right and you need to know what's in it to make sure the examiner did everything right IAW the VA clinicians guide in case you have to appeal the rating. Until then, try to relax. I know its easier said than done but try anyway.\n\nFor a little \"light\" reading I'm enclosing the guide for you. The exam on TBI is extensive and it might help you to understand what they were doing...",
    "Response_2": "Thanks for that document - lost it in the shuffle & it will help me out next week when I go get my back checked out.\n\nAppreciate the encouragement to not let things get to me. Sometimes I just have to vent a little and I'd rather vent here than to someone who holds my future in their hands",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 26,
    "Question": "Hey guys... quick question. I was wondering if the PEB letter stating \"Cognitive Disorder and Migraines- residual of Traumatic Brain Injury\" is enough evidence to FINALLY receive my purple heart. I have paperwork that shows me going to the TMC in Iraq after one of our blasts, and some history... but I feel the ARMY PEB stating I have TBI is exactly the evidence needed to receive it. At least it should be.\n\nBTW I am NOT a medal chaser... I have been EOD for 8 years... and was in iraq for 15 months. We had over 2000 IED incidents and I was blown up several times.... only once was I able to see a medic for documentation. \n\n\n\nAnyone heard of using the PEB Letter to the VA as evidence?",
    "Response_1": "No. Its not a source document. But it could be used in conjunction with treatment records generated at the time of injury to support a PH. The law says for a PH you have to be wounded as a result of hostile action, you have to be treated for the wound, and that treatment has to be made a part of your official record.",
    "Response_2": "also having the Purple Heart... It will make it very easy for you to get CRSC for the TBI since you will have it documented.\n\nP.S. During the holidays this site slows way down (just like the MEB/PEB), sometimes people don't get much to give advice. It'll pick back up around the 2nd week of Jan.",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 27,
    "Question": "I had 3 mTBIs on my last tour to AFG in 2011 with 2 Purple Hearts and took and Neuro Psyc test that was found inconclusive possibly due to all the 13 meds I was on. So even though I suffer almost all the after effects of TBI they found me fit for duty in my NARSUM b/c the Neuro Psyc test was inconclusive. Did anyone of you have to take a Neuro Psyc test? My OTs clearly write up all the time my cognitive and memory and pain issues with my TBI... what do you think?",
    "Response_1": "Here is what they wrote in my NARSUM:\nb. Traumatic brain injury (mild) with residual migraine without aura and light sensitivity, 346.11. Fails to meet retention standards IAW AR 40-501, Chapter 3-30g,j, 41e\n\nIf you are still having headaches and other symptoms associated with mTBI, then you should fight it. Also, you should have your loved ones write sworn statements on your conditions. They should specify on the letters how you were before deployment and how you are now. Also, should be listed how it affects your daily living activities.",
    "Response_2": "On my 3947 (NARSUM) It lists all ehight of the different claims. The only one with a write up is the one that I was found unfit for. Diequilibrium due to blast exposure. The rest just have \"meets retention standard behind them\".",
    "Response_3": "I had to take the VA neuropsych exam.....and I am still pissed. They also did not take ANY of my OT nor doctors exams diagnosing me with mTBI with memory and concentration residuals. The VA exam said I was performing sub-standardly to get a higher rating, my test was inconclusive, and they wrote that I was malingering. I am raising it to highers and may do a Congressional. I spent eight months in TBI rehab and physical therapy. I added my doctors notes as evidence in my rebuttal and addendum and they STILL only took the VA's neuropsych writeup. As a result, my 3947 states 'mTBI with no cognitive residual effects.'\n\nWhen I called legal, they said they are seeing a lot more of the word 'malingering' put into VA exam results. I have requested a MILITARY retest, so we'll see what happens. I am also going to see if I can get it changed somehow in the DoD/VA results.",
    "Response_4": "I had the malingering/ or \"diagnosis of PTSD for secondary gain\" originally in my NARSUM. I told my PEBLO that it shouldn't be in there, medical facts were all that mattered, not the opinion of a doctor whom has never treated me. They took it out and my NARSUM went from 8 pages to 22 pages (all medical information). I TOO got the \"mTBI with no cognitive residual effects\" yet my tests show otherwise... so I just left it. The test prove there is cognitive effects.",
    "Response_5": "I took multiple tests, the first few were inconclusive like yours, but they finally said I did have TBI... They were having a hard time because of my MH diagnosis issues since I was borderline PTSD... I was years for them to figure the whole thing out�"
  },
  {
    "Question_id": 28,
    "Question": "Here is what was typed in the MRI conclusion that caught my eye and after thinking about it contradicts its self.. What do you think??\n\n\n\"The signal intensity in the deep white matter and gray white matter junctions demonstrated 2 small foci, less than 2 mm in size, of increased sinal intensity on T2 and FLAIR images in the right frontal and left posterior parietal deep white matter are of no clinical significance. These types of LESIONS are seen in 10% normals of this age.\"\n\nIf they are seen in 10% of normals, than 90 percent dont have them..right..??? Therefore putting you(guy with the 2 lesions i.e me) in a 10% category having lesions on my brain that 90% of people dont have...\n\nSanity chek please anyone.",
    "Response_1": "Sounds like the old excuse I used to get \"30% of all people with a bulging disk have no problems\" I had two synthetics, three ruptured and two herniated.\n\nIt may or may not be anything. In my case I ended up using civilian doctors and paying out of pocket for treatment and diagnostic testing; sucks, but I forced the army to acknowledge my nerve damage and liver damage and I should make the money back in three or four months based on increased benefits.\n\nThere are some conditions that there are few or no diagnostic tests for; for example I believe MS may be diagnosed by excluding other possibilities; but I could be wrong. So while the MRI may or may not be significant, the symptoms that you describe to you doctor can be even more important than a diagnostic test. Hopefully you have a good doctor.",
    "Response_2": "I had those issues in my early 20's, I went through years of studies and appointments, I went to a new primary doc and had me take celexa for 4 weeks, by the time i hit week 3 my conditions cleared up... turned out that i had a chemical imbalance in my brain due to malnutrition and exhaustion. I had \"neurological seizures\" on the left side of my body, my face would sag like i was having a stroke too... Just an idea for you guys",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 29,
    "Question": "I'm a SSG in the Army National Guard. My last deployment a few years ago we did route clearance in Baghdad. My platoon was hit multiple times and I felt \"dazed\" a couple of times. After our return the nightmares and thoughts of suicide prompted me (through the encouragement of my wife and other Vets, mostly) to seek help with the VA for PTSD. They had me file for PTSD, hearing loss, superficial scars and tinnitus, all of which went through. I was rated at 60%. In talking with my counselor at the Vet Center he felt that I might have TBI as well. I've had headaches since 2008 (while on tour), have been hospitalized twice (once for having a grand mal seizer at the gym, the other when I had a headache so bad I asked my wife to get a knife so I could stab my eye to relieve the pressure), have sensitivity to light and have a hard time judging distance (run into things with a grocery cart, run in to parking blocks with my car, etc). I've only had the one major seizer but \"may\" be having \"minor\" seizers in that I sometimes don't know where I am, how I got there or what I'm doing. The VA has diagnosed me with TBI as well so I have filed for that, too. Can they say that my PTSD is not actually there and it is really the TBI that is messing with my head? The VA hospital has me scheduled to stay there for a week where they'll watch me with a video and have sensors on my brain to see if I am having seizers. I don't think that are frequent enough for it to be picked up in a week as I only remember it happening four times (once in Iraq, the other three here). \n\nAlso...yesterday I was finally able to navigate the MEDPROS area and found that I have a permanent profile. They have my PULHES as 111313. It shows that I am non-deployable and am not able to carry a rifle. Not a good thing for a combat engineer. I've had that profile for two years and have qualified twice with the M4, ran a range and went to Javelin school for crying out loud! It says I need a MEB. Will that board lift the ban on me handling a weapon or is that the board whose job is to kick me out? I understand that if I am having seizers that I probably can't deploy. I don't want to put Soldiers at risk or compromise the mission. But I still feel that I have things to offer to the National Guard and the Army in that I can teach Soldiers the kind of things you don't learn in school. What should I do, and how can I prepare for the board? I don't want to be medically retired. I feel guilty enough taking a check from the VA when I normally function pretty well. I won't hide things on that board and will tell them the truth, but I don't want to get out. \n\nIn case anyone didn't know...getting blown up sucks.",
    "Response_1": "I am having a problem with the Arkansas Guard. I am headed down the road to the MEB and don't know what to expect, I was in Iraq a few years ago as well and came home with a few issues and do not know what to do. I worked temp and long term orders for the Guard since 2002 and I get back in 09 from deployment and all the sudden they don't need me, then when they decided to toss me some work as a 92a I had to go to school which was great! But then I go on orders and hurt my knee and needed surgery, Well now the stuff hits the fan, the TMC takes me off orders sends me to a civilian doctor who says I need surgery and I go six months or more in dept because the guard dropped my INCAP claim because I don't have a civilian job. For goodness sake I work 300 days a year for the guard, where do I have time for another job? And then they send me to get a walking profile and find me unfit for duty , so now with my finances in the trash and my health the way it is I find I cant trust what the Arkansas Guard says or tells me because I know I'm headed for a rougher time than I can imagine.. so if you find anything out let me know, so maybe I can be prepaired.",
    "Response_2": "Sorry for your issues guys. Here is a good site to start with. http://www.lawyersservingwarriors.com/. Where do you live c.chestnut? Before I left to go back on Active, I was drilling out of Lincoln Arkansas and did a couple drills in Bentonville.\nI would contact Lawyers serving Warriors, they will get you set up with an Attorney in your area that is pro-bono.Good thing about Civilian Doctors, they aren't bound to the Military. \n\njw carter I don't know of anyone who got tagged PTSD ever get it removed. Once it is in your records, you can't even own a gun by law. If caught, you could be in a lot of trouble. It is sad, but the law. I don't know if Military is the exception. We have a lot of great guys here that might know the answer.",
    "Response_3": "just because you have been rated for PTSD and they are now claiming you have a TBI also, you are assuming that you will lose the PTSD rating or get it lessened?!?! Wow! HELL NO TO THAT! You are going to either keep your rating for PTSD or it is going to get bumped up. TBIs are no fun and I deal with them just the same as you. The VA says I have PTSD, the DoD says I have Major Depressive Disorder and Mild Anxiety Disorder... Yes I have 2 different TBIs one repeated (5) explosive concussive in one night and one blunt force trauma. TBI and PTSD have nothing to do with each other even if they happened on the same event/moment!!!\n\nAnd yes, boom-booms suck!!",
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 30,
    "Question": "This might be a silly question for someone who has been in for a long time, but, is there a way to have your SF600 automatically filled in? Or do I need to go in and have it all filled out by the doctors who treated me. I have over a year of appointments I need put on there for proof of treatment and diagnosis of TBI, so just wondering about an easy, efficient way to fill it out. Thanks.",
    "Response_1": "Are you talking about appointments/treatments that you had accomplished outside of military docs? If so, your PCM should be able to transcribe your civilian visits. However, he/she will probably want to deal directly with the docs that treated you to obtain the info. The SF 600 is an official document to be completed by authorized med personnel only.",
    "Response_2": "Thinking about it, though, as long as you have records of your visits/treatments, they can be added to you med records without being transcribed to a SF 600. I've had this done many times...I had the docs fax/email the documentation to Tricare, and they routed it to my records. Just ensure that you follow up and make sure everything makes it into your records.",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 31,
    "Question": "I am active duty military military with 13 years faithful and honorable service. Im able to reenlist next week. But I have some questions about the tbi process I am going through and what I might be facing here in the future since I have no experience with it before. The last 2 years I had 3 seperate head injuries that all led to ER room visits. One resulted in fracted bones ine my skull, another seperate one shattered motorcycle helmet, another shattered shoulder which ultimately my head took the brunt of it as well leaving me unconscious for about 30 mins. Any how. I have been going to TBI on Lejeune for almost a year now for my symptoms and have been going through al the meds for Migraines, sleeplessness, which, dont really help, I did vestibular rehab, which helped a little but now I feel dizziness creeping back into my routine. I have been doing cognitive cognitive rehab for 7 months and honestly I put my best foot forward as I always have in everyhthing and its a waste of gas. So finally I am going(referred) to a psychologist for a neuro psychologist exam. To be honest I have extreme feelings of despair sometimes where I feel the \"bottom falls\", confusion, inability to pay attention an keep on track, etc. It very frustrating and depressing because I have always been meritorious in all that I have done. I had to do anger management because of some of the crazy mood swing I and others noticed I was having since then. It sucks.\nAnyways, here is my question, with the psychologist test/eval still being worked on. If I reenlist is there a possibility that I could be medically seperated with my conditions?",
    "Response_1": "Were any of these accidents in the war zone or all motorcycles. If your enlistment ends next week, they should MEB you if these issues cause problems with you doing your duty. If they are unwilling to MEB you, I would re-enlist until they decide to MEB you. The Department of the Navy is well known to find you fit for duty and then admin you. They past a law to prevent this and you need to ensure you research this and make sure it doesn't happen to you.\n\nIf all of these accident were caused by you on a motorcycle you might want to consider something with 4 wheels or safer. I knew to many people who died on motorcycle and that had always prevented me from getting one. Gas prices are slowly encouraging me to get one but being dizzy still prevails.",
    "Response_2": "Actually only 1 of them was while I was on my motorcycle. And it was 100 % not my fault. Got the command investigatation and police report to prove it. the other 2 were not in combat either. It was a strange rash of luck guess u could say. \nWell, the conditions that are really affecting my job more appearantly to my command is pft cft. I can't run. I got a busted up knee really, like 32 stitches, torn miniscus, fractured patella, or suddenly \"biappartle patella\" that so happened that very same day lol.. anyways I haven't had any surgeries, just rehad and gutted it out. But now I know something is very messed up. Had a mri last week again. But I got a gut feeling its gonna be a show stopper down the road. I know me and I know what my body is tellin me.",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 32,
    "Question": "I was rear ended on Post while on duty, the lady was crying and I was dazed and confused she was late for a DR. Appt. so I got her info(no MP report) she reported it to USAA the same day, two days later my head was hurting so bad I could not get out of bed I called made an appointmet with my PCM, a Few shots later the MRI's started then the Brain lesions, neuro, meds, seizures, no driving, tremors, spots in vision, blurred vision, insomnia, 35 lb weight loss, depression, psychiatrist, psych evals, put on ssdi, WTU. Now I was called and told too file for tsgli even with all the documentation they say I need an accident report even though I was on duty at the time of the accident, My question is could or is there another way around this? I have Memos from my PCM, Top, CAPT that this accident happened at this time and that I had none of these problems before this, what should I do? Jason or anyone>",
    "Response_1": "Seems to me there are two options. Try to get the MP's to file a report, even at this late date. They may not be able to do an incident report but instead just an information report (some of the nomenclature may change depending on what branch or if civilian DoD Police handle these matters). If they do issue a report, then no problem. \n\nThe other option is to just file and see what they say...if they deny based on the lack of an accident report, it sounds like you could appeal. Obviously, it is best to give them what they ask for, but if you can't, then I would say your only other choice is to press ahead. Sounds like you have good supporting documentation, so I would not think you should have a problem. As always, you have to see what they say.",
    "Response_2": "One of the most enjoyable things that I got out of my military service was helping others. It is a responsibility, but one that feels great to fulfill. That is reward enough, but I figure that if there is some kind of karmic scorecard out there, it never hurts to help people.",
    "Response_3": "I have TBI and I was woundering would I get tsgli just off TBI and the fact that I don't sleep I ant drive cuz I daze out and I have all the memory loss n not able to do normal things as a soilder with all the paper work that I have",
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 33,
    "Question": "Up for a MEDBOARD next onth. Have TBI, Residuals, headaches, hearing loss, ptsd, shoulder, knee pains. Whats the likley hood of them kikcing me out?\n\nI hit an IED in 2009 and sucked it up for a long time. There were so many issues accosiated with TBI I figured it would be stupid to try to bring it up cause I figured I was JUSt strange.",
    "Response_1": "Depends on the impact of your conditions on your duty performance. Do you have significant duty limitations? If so, your separation/retirement is likely. Would need more info to offer more.\n\nSorry to hear you are going through this. If you have questions, please let us know.",
    "Response_2": 0,
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 34,
    "Question": "My husband has PTSD, anxiety disorder and major depression. He is also having memory loss, headaches, stomach cramps and other issues. He was knocked out 3 years ago for a few seconds, but has just now told us what happened to him. I am wondering if he has a TBI...is it too late to see? He has also gotten addicted to painkillers to help with the ptsd, he tried to get help through a treatment center and got on methadone, while on that he took a xanax(he had informed the doc who prescribed the methadone that he was also taking xanax and the doc never said anything...but had a overdose of methadone a couple of weeks ago and the memory loss is getting worse, he also has tremors, is cold all the time...they did a CT at the hospital and said they didnt like the way it came out, so they did a MRI, but said it came back fine...should we push for another one to rule out TBI, or is it too late? Thanks.",
    "Response_1": "Make sure you get a second opinion because if your husband does not have a hole in his head they will definantly try to overlook TBI. They are not on your husbands side they will dismiss it as PTSD or anxiety and deppression. They did the same thing with me but I have never noticed having PTSD and forgeting to turn my car off and leaving it running while I shop at wal-mart. Definantly get a second opinion and make sure it is off post far from your base. Also get a neropsyh exam it will be the only test that will save him later down the road. GOOD LUCK",
    "Response_2": "I would say that with multiple diagnoses, the issue of TBI might be overlooked. Might make sense to get a referral to a specialist. Here is another resource: DVBIC - Home",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 35,
    "Question": "I am retired, AD 21.5 years and 80% disabled. I have memory loss (short term) and was going through TBI appointment after TBI appointment at the Temple VA in TX. One visit (last Fall), the Doctor tells me...oh, your TBI didn't happen in combat so I am going to terminate this line of treatment. Yeah...I know the list of questions that should pop into any normal thinking person...\n1. When did the TBI happen? a. I have memory loss, I don't know! :rolleyes: \n2. Why did she start treating me for a TBI and then change her mind? a: I don't know...:mad:\n3. What is the process the VA uses for treating TBI patients (and criteria used to just \"terminate\" treatment? :confused: a: I don't know...and neither does anyone else from what my research has uncovered...then again, I just learned about this forum!\n\nI do know I was involved in two IED's during my tour, but neither hit my vehicle directly. The worst of them was when I was in the truck behind the one that took the direct hit, we drove through the blast, singed our facial hair...and went to work recovering our injured Brothers. While AD, I also went in for a routine procedure prior to neck surgery...called a myolagram (or something like that). Anyways, they said the dye from it went into my brain and caused me to have two Gran-Mal seizures....hmmm, think that might have caused a TBI???\n\nOkay, up to the minute...I was diagnosed last summer with a \"Cognitive Disorder\". When I asked the MHE Pro if that meant I had a TBI, she replied; \"you have a cognitive disorder\".\n\nCan anyone break this down into simple terms for me? I believe I included this in my appeal (to my disability rating) I submitted in February...but still haven't heard back either way on a decision! I am reaching out for general info to see if one of you brings up something I didn't think of or that I haven't already covered....thanks. Remember-no question is stupid, no answer is redundant!",
    "Response_1": "they said the dye from it went into my brain and caused me to have two Gran-Mal seizures....hmmm, think that might have caused a TBI\"\n\nTBI : [ame=http://en.wikipedia.org/wiki/Traumatic_brain_injury]Traumatic brain injury - Wikipedia, the free encyclopedia[/ame]\n\nTBI is caused by trauma, directly or indirectly. For example, your head hitting something or something hitting your head. Or shock wave from a blast.",
    "Response_2": "remember that you can have both, TBI and a cognitive disorder (caused or not by the TBI). \n\nThere are two separate issues, the impact this has on your treatment and the impact on your disability benefits case. I will leave it to your doctors as to the treatment, but as far as your case, it is very important that they consider the possibility of rating under residuals of TBI.",
    "Response_3": "Did you tell MS. doctor you were involved in 2 IED blasts. On my first tour when you were involved in a IED blast if you weren't bleeding no big deal so no record of it . On my 2nd tour if you were involved or close to the blast you had to go to charlie med and it was put in your medical . point being it doesn't have to be in your file for it to have happened and they cant say it didn't . If worse case you get a statement from some one that was there. Also are you doing this alone or do you have help from a service rep like the DAV ??/",
    "Response_4": "I can only speak about the VA. I got rated at 70% cognitive 50% headaches for my involvement in 6 ied blasts 2 direct hits with out a purple heart. you have to stay on top of the VA I got the # for the regional office in my area you can call and check on your claim and I did often . I was told that I was waiting on my rating for TBI so I called the # just to check and the lady said your TBI stuff is sitting at the VA hospital they never sent it that was 3 months after C & P If I didn't check it would still be in the same place. your doing the write thing doing all your own leg work . just check up on the VA often. I would go back to the VA and tell ms. Doctor you were involved in Ied blast and you have docs on it and resume your treatment for TBI. cognitive problems are from TBI as are a # of other things . I did notice my problems write away after blast if you say you didn't they will try to blame it on something else meaning not service connected so yes you did notice these problems you just thought they would go away but there not so that's why you are there for help.",
    "Response_5": "Just make sure you document everything ! You can go to medical with out being a shitbird just go in tell them what is wrong say you want to document it they will write it in your med record then leave ... it must be on paper !!!! every thing !!!!!!!!!!"
  },
  {
    "Question_id": 36,
    "Question": "I received an injury about 3 years ago that while being documented(labeled sciatica and nothing else) the doc at my prior command never ordered an xray or mri. After transfer to a new command I had further problems with my back and after finally getting the Xray and MRI done I found I had 4 damaged Disks in my back as well as a curvature in my thoratic spine . Anyhow ever since the Incident I have sometimes had a hard time with speaking particular words in a sentence (example- say I was pointing at a notebook and not remembering the term \"notebook\") like I had forgotten what it was called. another example is phone numbers, simple 7 digit number or even shorter, someone telling me a phone number or a combo for a lock, I resort to having the person slowly individually repeat them to me as I try to write them down(this sometimes takes about 3-4 tries). Other things include trying to listen to someone, while hearing the words clearly, only recognizing only about 2-3 and asking the person to repeat themselves. The Injury that did damage to my spine was incurred by me being thrown out of my coxswain chair a rough seastate (27 ft boat in 16-18 ft sea at around 01-0200 doing training support operations), I impacted with my neck and head on the overhead then thrown down to be greeted by the rising coxswain seat which I broke as I hit. Could this possibly be signs of TBI and should I be asking for a consult to determine if indeed I had received this. These things don't happen all the time and should I be concerned?",
    "Response_1": "Yes! You should get a neurological work-up. This will help with your benefits, but more importantly, you could have a serious health issue.\n\nI hope all goes well for you.",
    "Response_2": 0,
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 37,
    "Question": "Anyone here being treated for Vertigo or Migraines?? If so anyone know anything bout keeping a daily/weekly log for each of Migraine and Vertigo??? I have read other posts. Just trying to get additional ideas for different log for each. I cant even think bout what to put on the log.\n\nIf so please detail what you documented in the log. I need help. My doctor is askin for that on wednesday. Please be specific on what to put in the log... \n\nThanks",
    "Response_1": "For myself, I just use a calendar and each day that I have one I mark it with an M, I notate start time, what I take to try to eleviate it, and its dosage(i.e Motrin 500, Oxycodone, Dilaudid,etc). I also notate the weather, as when it rains my migraines tend to kick it up a notch. If you are sick with allergies/cold, etc document that. I also limit my dairy intake, so if you can list your foods, sometimes you can see a pattern. Notate symptoms- light sensitivity, nausea,etc. Make a note of the relief with the meds, and if it lets up. I keep all er reports for my migraines. I hope this helps. Try checking webmd.com they have a free printable migraine diary, or you can google migraine diary, and some of the other sites may have one that you may like.",
    "Response_2": 0,
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 38,
    "Question": "I was out on an airborne mission in NCT and got hurt. I was in the hospital for three days and diagnossed with a TBI. I lost 10 hours of memories due to the injury. i went from my home base to wakeing up in the hospital.\n\nNow I have an update on my condition. I was out having chronic migraines, insomnia, short term memory lose, trouble focusing and concentration, depression, personality changes.\n\nThe Migraines were being treated with maxault. But that didn't help after a while. So I got put on topamax. The neurologist also put me on zoloft for my depression and abien for my insomnia. \n\nNow I am having confusion episodes. On Monday I called my wife and talked to here in a wierd way in short burst like sentences that totally wasn't like me and didn't make sense, so she says. Then thursday I was found by my wife wondering around my company area on the phone with my platoon sergent totaly confused about where i was and what was going on. I dont even have any memory about the incident. my first memory was about the ER. She said I called her and wasn't making sense on the phone, and my platoon sergent said the same thing.\n\nSo the DR in the ER admitted me, and I was diagnossed as having a siezure. they put me on anti siezure meds and took me off my zoloft. \n\nthey said that I need to have 6 months of tests to determin what is wrong with me. \n\ndoes this sound right?\n\nwithout my zoloft (since I have been on it and it helped with my moods) won't I get really really depressed now?\n\nCan't i get a 100% discharge for TBI related siezures?",
    "Response_1": "i have a similar issue. i'm on seizure meds w/zoloft. neurontin 600mg 3x's/day and 150mg of zoloft/day. so i don't see why they wanna ditch the zoloft if it's helping. mine are of unknown origion but the docs are starting to think it's from the PTSD, depression and anxiety. good luck and keep us posted.",
    "Response_2": "Well it is difficult to find out what is wrong with a person if they have a clear MRI/CAT. I think they will be doing alot of blood work and then seeing how you do on meds & every 30 some days, they may swap to another (process of elimination), that takes a while. Anti depressants are really just chemicals to replace what your lacking. That is what they usually throw out there for people that get migraines. \n\nOf course I'm not a Doctor. If you have medical questions, I suggest that you write them down to take to your next appointment. Maybe even book a \"two slot appointment\" if they ask why say you have many questions and would like to set down and talk to your doctor about your condition. Also you should keep a journal of medical issues and what lead up to it with times dates and trigger events. Since you have memory loss, have your wife keep one of you to with her perspective. Then present that to the Doc also.",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 39,
    "Question": "Just yesterday I was seeing my doctor and found out that while I was seeing her I had a Complex Partial Seizure. So it turns out all those people that were worried about riding with me dont have to worry about it anymore becuase I can no longer drive. \n\nMy question is I have been complaining about this stuff for as you can see up to 5 years, and it took for me to have a seizure for some one to take me serious. Now I have no idea what the future holds for me. I am not missing any limbs, apendages, or eyes...and I was a fully functional soldier so that was how I was viewed, but damn sure not how I felt. Now I am trying to get in WTU in FT SAM HOUSTON to get help with this and I am worried that people will drag thier feet as usual.\n\nIf anyone can help me, I am begging for it!",
    "Response_1": "I wish I could say your situation is out of the ordinary, but as many hear can attest, getting properly evaluated can be difficult. I am sorry to hear all that you have been through.\n\nWhat I can say is that it is almost a certainty that with a seizure, you will be referred to a MEB. Whether or not they assign you to a WTU is a different matter. They are downsizing the WTU's and I think much will depend on whether your care can be effectively managed in your present unit. \n\nThe key to success with the MEB and PEB is having good documentation of your conditions. If you have been seen for your conditions and have treatment notes in AHLTA, then you are on the right path. If you have been suffering, but have not sought treatment, then you should start. \n\nOne thing I have seen is that Servicemembers who are able to be seen at the Defense and Veterans Brain Injury Center usually have very thorough evaluations. This can help greatly with documenting your injury. Here is the website: http://www.dvbic.org/ The number is 1.800.870.9244 . You can find out about referrals at that number. Aside from the legal and administrative advantages, you can also get good treatment (I have no personal experience to base this off of, but have heard good things from clients and others who have been referred to this program). \n\nI hope this was helpful and that you get a good outcome. Best of luck and feel free to ask any questions.",
    "Response_2": "I am actually working to let my unit either send me to BAMC or to one of the care centers referred to me by dvbic.org. The problem is that every time I mentioned TBI in the past people were quick to change the subject. No one wanted to talk about it. I made appointmets specifically for my Symptoms and end up leaving with nothing.\n\nThis is where I have realized my functional soldier status. Since all of my scars are on the inside and none on the out, people see me as a fully functional soldier. I could go on about this for hours and hours, I will not do that.",
    "Response_3": "i feel your pain about having all your injuries/disabilities/scars on the inside. i had an LOD back ijury in 2006 which just kept getting worse after each surgery. 4 in total. MEB was initiated for back injury in 2007. my stuff has been @ the IPEB since feb 2009. i also started to develope numerous residual medical issues. my mental health diagnosis changed 100 times. right now it's PTSD, depression and anxiety. i started having seizures/dizzy spells/vertigo. when i started going to the VA i did the TBI screening, tested positive and have been being treat @ the TBI clinic, but the doc tends to think it's not TBI and my siezures/dizzy spells are more related to caused by the PTSD. \neither way i know how you feel about this whole thing. if you have any questions or concerns, or just need to vent, feel free to contact me @ any time here.",
    "Response_4": "You should really email me directly: nathan_green76@yahoo.com We have a lot of the same issues. I have had numerous vestibular issues...not with my ears...but with the head-- Diagnosis: \"Vertigio of central origin\". Basically my center of balance is off to the right and back from the REAL ctr of balance. I also can not stand straight for any amout of time with my eyes closed and if I will get really wobbly if turn my head while walking (ex. \"eyes right\").\n\nI also have sleep apnea from the TBI. I never had ANY issues before the blast. I was in perfect health and now I'm a mess. It is so weird that you have some of the same issues. I've been treated at Bethesda Naval and Walter Reed for the past year and still having a difficult time.\n\nOh...do a google search for Auditory Processing Disorder (APD). It is sometimes called Central Auditory Processing disorder...but it is basically where the info gets screwed up b/t your ears and brain. My docs think I have this because I have a really tough time with hearing. Everyone sounds like they are mumbling and I can't hear people clearly. I am getting more testing but this condition is not all that common in adults...more common in children. It can happen due to head trauma(TBI), so there is a possibility you may have it--my audiologist really thinks there is a strong possibility in my case. Check out the links (ignore that they talk about children exclusively).",
    "Response_5": 0
  },
  {
    "Question_id": 40,
    "Question": "There is a program out of Houston Tx. \n\nTIRR Foundation Project victory can find online. Do not need to be active duty to use, a grant run program for those with mild to severe TBI and also PTSD. Contact Shawn Brossart by online link and the VA can help send you there or your case manager on active duty if they want to, but I am finding after my husband and I went for his TBI that Bragg case managers do not want to deal with something new like this so they are saying it is unavailable, but like I said you can also use the VA to access them. Shawn will help and it is life changing for someone with TBI and their families.",
    "Response_1": "that's good news! rhode island also has a rock-solid TBI clinic and they have a good PTSD clinic, that is seperate. if anyone needs any info on the RI one, i'd be glad to help.",
    "Response_2": 0,
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 41,
    "Question": "I believe that I am having some memory issues that are possibly linked to TBI.\n\nI was roughly 15 feet away from a carbomb/blast that resulted in schrapnel to my hose, eye, and neck. Also I recieved burns to my face, bi-lateral arms, and bi-lateral legs. Both of my Tib's/Fib's were shattered and took roughly 1 year to heal. After the blast I was awake, I remember everything up until I got medvac'd out(20minutes tops). The next time I came to was maybe two weeks later.\n\nQUESTION: What do I need to fill out to get checked for TBI?\n\nDoes anyone know what these tests consist of?",
    "Response_1": "Sorry to hear of your injuries.\n\nI see that you're in S. Korea and that you were medically retired. \n\nIts a possiblity that with what you went through that you could be experiencing TBI...but other things can cause memory loss too-diabetes, poor diet, stress, many many things. \n\nYou definately need to see your physician and have him look at all possiblities. \n\nSome tests that are done are the standard MRI's, CT's (acute), and neurological testing. I'm sure other guys who have been through this will \"chime\" in and give you ideas of what they've been through.\n\nFrom your explination of the injury it does sound like your brain was protecting itself from further injury ( going out for a while)...you have probably been told this already...but your body was probably initially in the flight/fight response protecting itself from further injury-that's why you were awake...(shock)...then when you went out, your brain was probably protecting itself from further injury...I'm sure doc's said you had brain contusion(s) (being that close, having facial injuries, having blast injuries)...anyway, when the brain needs to protect itself it will go into a coma...thats why docs put some brain injured patients into induced coma's-to give the brain a chance to heal...so, your body was already doing that. Also, lets not forget that there could be psychological reasons for memory loss...I'm just bringing it up because that might need to be looked at in conjunction with the physical exams. Total health care. \n\nBut you need to be seen by your physician. Now, who is that for you? Do you have TRICARE there? VA there? Other guys who know more about that detailed \"form\" stuff will chime in and help. \n\nSure hope you are doing well other than that..hope that gives you an idea..take care.",
    "Response_2": "i was initially worked up for seizures my a civ. neurologist when i started having episodes. had all the EMG's and that type of stuff. not once did the military docs. or civ. neuros. say TBI.\n\na few weeks ago i had my 1'st VA appointment. they did a TBI screen and i screened positive for it. so i know there is a screen. i was also referred to my VA's TBI clinic. i would start by asking your doc. it's (the screening) kind of like a PTSD screening, if you have ever had one of those. they ask your typical questions like: have you been around explosions? do you have sensativity to lights? any psychological changes? sleep issues? ever lose consciousness?\n\nhave you filed a claim for the VA or do you have a rating? i would start there. you can use any VSO to help with the claim. also on-line there's a VA EZ form to apply for health care and that will start the process on that end. like you said about the VA field office, i would start there and do that ASAP. good luck and if you have any questions, i'm always here.",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 42,
    "Question": "My husband is in the PEB phase. He was just found unfit and are waiting on ratings. He has been active duty for 25 years so has a lot of physical issues as well as combat PTSD. His board was put in for PTSD as the only unfitting condition. He clearly has had several TBI's, and they are clear on his MRI's. The C&P's show all the residuals addressed. We went back and forth with the neurologist and she was unwilling to write and addendum for TBI saying it is not unfitting and it is all the PTSD. Neuropsych testing was done and shows deficits in processing speed and memory but she says they are not bad enough. He also has issues with migraines, vertigo, tinnitus, etc. He was tired of the back and forth and signed the narsum and sent the package off without a TBI addendum.\n\nWe were told if the VA ratings for the TBI and residuals come back high enough we should appeal the DOD. Any advice. My husband just wants to give up, but I want it done right. Thanks so much.",
    "Response_1": "In my opinion at this particular point within the DoD IDES process, if you believe that the TBI medical condition and its residuals are affecting your husband's ability to \"reasonably perform duties of his or her office, grade, rank or rating\" then upon receipt of the IPEB findings you should request a Formal PEB hearing and proceed from that point. Take care! :cool:",
    "Response_2": "I will be back here for sure when the ratings finally come in! Now all I can do is wait any hypothesize until I drive myself crazy! Hubby want it to be over, but he \"Bull Dog\" wants it right.",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 43,
    "Question": "Like many of you I spend way to much time thinking about this stuff but I decided to keep an updated logg of my progress and what better place to keep it than here.\n\nBack in 98 while in basic training I was knocked unconcious when a fellow recruit hit me in the head from behind by swinging butt stock of his m16 like a batt. I was unconcious for nine hours and awakened at 3 am when I was found in the woods.\n\nThe drill sgts swept it under the rug and was simply labeled as a training accident.\n\nFast forward 14 years and I have many problems.\n\nSever loss of hearing, Loss of balance, Slurred speech, Numbness in left facial area with drooling, Decreased memory\nIt was all a lil too much and I contacted the suicide hotline.\n\nIn the middle of may 2012 I was seen by a phych and after describeing my symptoms the doc asked if I ever had an head injury to which I described the above.\n\nA week later I went to intake were I was recommended to go through neurology.\n\nThe first week of june I was seen by my provider. I was given a cat scan wich came back clean.\n\nMy next apointment was the beginning of july 2012 with my provider. I am now scheduled for the following in the month of July 2012\n\nNeurology\n\nNeuneurology\n\nMri\n\nSleep apnea\n\nIll update the results of the appointmentments",
    "Response_1": "well it sound as if you have the symptoms of TBI and your getting looked at for it...once they have a proper diagnosis and you get some treatment if there is any.\n\nthen you should have enough evidence to get it rated by the VA... half of the issue is being treated! they want to see that. make sure that if your using an outside Dr. that the records are giving to your VA PCP and he or she puts that info in your records.",
    "Response_2": "I have had chronic PTSD. Been on meds (which help) but still suffer from it. I was exposed to a blast in Iraq in 04'. I screened positive on the TBI verbal test. I was given a head CT that came back clean. I spent about 30 minutes with a VA doc that determined that I didn't currently have a TBI. I have headaches daily, forgetfulness, lack of concentration, sleeping problems, mood issues, dizziness, vertigo etc...According to the VA website, I have all but about 2 of the symptoms for TBI. My PCP thinks I have it as well but will not fight Polytrauma. I do have another appt with my PCP so that he can tell me the next course of action for the headaches. I know neurology will not treat headaches. The nurse told me that directly. I do have the backing of the OIF nurse and Military One Source. My question is...\n\nWhat do I have to do for them to take me seriously and diagnose me with MTBI? Has too much time gone by? Do they think it is all of this is PTSD? Personally, I don't think they know enough to make such a judgement. What is the defining thing that makes it a TBI?",
    "Response_3": "You need to deal with the VA's Polytrauma department. So you filed a claim for TBI and VA has not sent you an examination yet? Polytrauma will give you a series of tests. I am 100% for TBI because some assh*le blew my truck up in Iraq. The evidence was overwhelming.\n\nGood luck",
    "Response_4": "Just finished my first day of testing at the neurology clinic.\n\nTook maybe an hour of memory questions and can you feel this and that type stuff.\n\nThey requested a copy of my mri results and will then reschedule me.\n\nAll in all very professional. They are getting paid by the va but otherwise have nothing to do with the va and the atmosphere was very relaxing",
    "Response_5": "Heck if I know...\n\nI contacted the suicide hot line and the next day I met a va shrink. I told him what problems I was haveing and he asked if I ever had a head injury. I told him what happenned to me and a few days later they put me in intake.\n\nTold the sych what happenned and she said she didnt think tbi but depression.\n\nI met with my va doc and told her my symptoms and she scheduled me for all these test. Honestly I feel for sure I have tbi. Just one year after my head injury my medical records sho I complained of blurry vision and went from perfect hearing to needing hearing aids.\n\nHow did know one include myself catch this? Funny thing is Id forgotten about being knocked uncoucios till that va doc asked me and never thought for a second my hearing loss ect all stemmed from that moment.\n\nI can say without a doubt that my va doc who recommended all this testing is the only reason. She actually seemed to care and wanted to know whats wrong with me as much as I did.\n\nGod bless her and I hope you find one at the Va to help you as well"
  },
  {
    "Question_id": 44,
    "Question": "Any vets out there have a TBI that is service connected then find out you have central sleep apnea a few years down the line and have the VA try to say it is not service connected ?",
    "Response_1": "No TBI, but did get MSA Awarded Secondary to CAD. My Non VA Sleep Neurologist completed a DBQ with the \"More Likely Than Not\" linkage. CAD DX 01/2006, MSA DX 09/10.\n\nVery difficult for a VA rater to decide against a Sleep Disorder Specialist MD that is also a Board Certified Neurologist.\n\nIn the past 4 or so years of reviewing BVA Decisions, it appeared to me that the credentialing of a Dr is very important. More so when it comes to a \"Jump Ball\" situation, with dueling MD opinions as to the Nexus of a Vets DX.\n\nIf your VA Sleep Specialist is reluctant to opine on the Nexus of your CSA, might be time to find an outside Neurologist specializing in Sleep SA.\n\nSemper Fi",
    "Response_2": "To answer your 1st post, I have TBI rating, which was an in line of duty injury/ service connected in 2003, OEF/ OIF. I developed central apena this year. The VA prescribed a BiPap. \n\nI did my home work, and went to the sleep apena c&p armed with the three sleep study results, lay statements, battle buddy statements, and an IMO from Dr. Gary Anise.\n\nJust had it denied the other week. I have been looking for others as well. \n\nKeep in touch, please. And thank you for your service. Follow me as I get advice from Navy 04 and Buck very soon (I want to type carefully) bec they have been good with the no BS help/advice.",
    "Response_3": "You did submit the IMO directly to the VA Evidence intake center, well in advance of your C & P, right? In your recent Denial, was this IMO from Dr Anise addressed as to being Evidence of Record that was considered in the Decision?\n\nWhat exactly did the Rater state as the reason for your CA or MSA not being eligible, for a Secondary rating to your SC TBI?\n\nI trust you have already filed your NOD, requesting a DRO Hearing (my choice)?",
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 45,
    "Question": "File a claim for ptsd,and tbi to included headaches,May of 2003,did all of the C&Ps,  I was service connected 100% for ptsd for ptsd march 2004,claim for tbi to included headaches,was deferred 2004. I received a letter from the Department of  Veterans Affairs,January 2015 for four C&Ps for tbi to included headaches,no psy C&P. I was service connected 40% for tbi to included headaches and 10% for tinnitus,total 50% and no extra pay,because i am already service 100% for ptsd.The effected date for award is January 2015 for tbi to included headaches,no psy C&P. My Question is ,do i have grounds for a cue,on early effected date of 20003\n\nI had a c&p for ptsd.and,tbi to include headaches'. I was service connected 100% PT for ptsd,from 2003 , tbi to included headaches was deferred, they forgot, i forgot, Completely Ignore by va.",
    "Response_1": "Wow, that is not unheard of.\n\nIf it turns out that your TBI/HA claim was truly in deferred status from 2003 through 2015, then that means the claim was never closed (additional information is below). Your original effective date for TBI/HA could be corrected back to when you originally filed. It looks like they are treating your recent claim as a new claim, but not necessarily as continuation of an stale claim.\n\nFirst, double-check your records to make sure.\n\nSecond, let's make sure the VA records match what you have. This step is optional. if you haven't already done this, it might be worth requesting a copy of your claims file (c-file) from the VA. The reason for this is to double-check that they didn't send you a denial letter at some point between 2004 and 2015. If the VA has a copy of a denial letter/statement of claim (SOC), then that means you were notified (even if you never received it). It happens all the time because people move or mail gets lost. Keep in mind we have to prove the VA received our mail, but they don't have to prove we received their mail. If there is not a denial letter or SOC letter, then I think you are in good shape. Although this step is not a requirement, it would be worth knowing.",
    "Response_2": "On 12/20/2015 at 1:43 PM, mobie16r said:\nI Got,all of my medical records  and denial letters and military records.\n\nThat's good. If there is a lot, don't punish yourself by going through everything in one sitting. Take it in bite size doses and take your time. If any of your medical records are handwritten and you are unable to decipher the doctor-ese handwriting, consider asking a friend, doctor, or nurse to help interpret them. If they contain funky symbols, you can look most of them up online.",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 46,
    "Question": "OK, this is the information that I have now, I have been denied for head injury/tbi.  so please help me understand this If you can.  Do it look like the doctor said that it is direct service connected, but they think the etiology is something else.",
    "Response_1": "It does not look good, but you should read the whole exam and see if it has the magic words:  Veterans TBI is at least as likely as not due to xx event in military service.\n\nDid you have \"another\" incident that possibly caused TBI, such as a car wreck?   You need to wait for the decision, but you will likely have to appeal, and challenge this exam.  Ask to see his/her credentials.  Go over the exam with a fine tooth comb.  Are they experienced in TBI?  Are they an MD?  Phd?  Nurses Aid,  Boy scout leader? \n\nWhat about your other docs?  Surely you dont just have one.  What did their exams say?",
    "Response_2": "It would seem that the doctors are blaming something else for your TBI.]",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 47,
    "Question": "Has anyone had a TBI re-examination or has heard of whats going on? (my VARO is Saint Paul, MN)\n\n1. I claimed Closed Head Injury to include scar (DC 7800) in 2004. It was processed under BDD in San Deigo. DENIED\n\n2. In 2012 I requested to reopen the exam because I had found some STR's which proved the incident occurred (the Marine Corps lost my STR's during my deployment). The incident was non-combat. I was given a TBI exam by a NP at the Minneapolis VAMC and DC changed under 8045. DENIED.\n\n3. June 2015 I get a call from the St. Cloud VAMC for a C&P exam. I assume its for my skin condition because I had a follow-up exam because they didn't make it static. Wasn't till I got there I was blasted with a ton of questions instead of examining my skin what it was for. I did not ask to reopen or anything with TBI.\n\nI had my exam pulled and was found a positive opinion for TBI and Post Concussion Syndrome and looking through the facets, possibly 10/40 percentage. No mention of painful scar (anyone know if they would put this in addition too or just lump it in). Also I'm curious whether how far back they would go, because before exam there was nothing in ebenefits, but now I see there is a reopened claim with the date of 5/8/15.",
    "Response_1": "When I was medically retired in 2013, I was given a SC of 30% for TBI/Migraines. I opened up an FDC in Nov 14 for other conditions, since I was already 100% I think the VA thought that I was rocking the boat. So I get a call that I have a bunch of C&Ps in Feb 15 and all of my current High %s including my PTSD and TBI were being Reviewed, even though TBI was not up for Review until Feb 2016. No issues there, just when in to the Re Evals, and in fact it back fired on the VA's face, not only were most of my conditions continued at high %, but the RO increased my TBI from 30 to 50%. As long as your evidence and records are there, you have nothing to worry about. Good luck",
    "Response_2": "I was involved in a major explosion in the military (am service connected for it) and want to put in a claim for TBI. Everything is confirmed and well documented but I have a significant problem and show all of the basic TBI symptoms match. That is that I am very claustrophobic as a result of a tank accident that I was involved within in the Army. I was trapped in the Tank for sometime and it really affected me mentally. Anyway, my question is that during a TBI exam do you have to do an MRI on the head or brain? Frankly, there's' no way that I can be placed in an MRI Tube and have my head covered to do so? We've tried all kinds of sedatives and other methods to do into an MRI. The only success that we had was that we found a place that has an open MRI but it's mainly good for back and spine related injuries...Frankly,",
    "Response_3": "Sounds like my TBI examinations... I was a greenhorn with the VA had no idea (and thats being generous) as to how duplicitous they are. I went in because a friend of mine told me to just register with them. i went through some \"this is how the va works\" class and they had all the OIF/OEF vets stay to take a TBI examination.\n\nIt was the multiple choice questions, if you say yes to one or all of these sort of deals on certain questions you had to go to what i guess they call \"Level II\" testing.\n\nthats when they talked ot me in person. i told them when i was hit with the IED, i dont know if i passed out, i do remember seeing all the dirt lift off my cammies slow motion and thinking \"this is cool\", next thing i heard, since i was the driver, was being yelled at to drive, drive, drive since we were in the middle of an ambush. i dont know how long i was out, if i was out. i just remember those two little things. I dont remember anything about that day or the week after. They told me since i was unsure if i lost consciousness and since if it was less than a minute (how do i know how long it is if i dont remember it?) then i didnt have TBI. I forgot about (which is funny for my fellow tbi folks :) ) and then when i was on my third state and 8 years later when they called for one of those registries they asked if i had TBI, i told them the same thing the Level II folks told me, nope you dont. which is also what ive told the VA and on all my C&P exams fro mheadaches to ptsd. well turns out someone in the VA in my first state right after my PTSD DX made a TBI DX, no one ever told me and the VA never noted it in my records, etc.\n\nSo now i am working on a TBI case. currently drained after a proposal to reduce fight, ongoing battle to get my c-file and another fight for a dro hearing on my headaches.\n\nnone of the Level II folks were even medical folks just were fill ins who had checklists....",
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 48,
    "Question": "Hello all name is Russ A little background about myself I served six years as an 11B in the ARMY I was in Ramadi and Fallujah in 04-05. I have been Service connected for PTSD at 70% and tinnitus at 10% since 10 August 2007. I have been working as a police officer for the last two years. I just recently had a C&P exam for TBI. A little background on my tbi. I was hit by a number of IED's in ramadi the worst was two in a 24 hour period as a gunner. The first one knocked me out, I woke up in the aid station. So the post deployment health check up deal at Ft. Carson I was told I have TBI. When I put my original claim in back in 07 I did not put TBI. Jump to 2010, I ask my primary to refer me to the polytrauma clinic at livermore hospital. I get referred and go through all of the tests. The last thing I hear is that PNS team is going to review their findings and come up with a care plan. I never heard back from them. I did not actively pursue it either I was in a dark place at the time. So September 8th I meet with my psychiatrist and she looks through my records and the poly team determined that I have TBI. At the C&P appointment the Dr. Says that I have TBI and have had it since 2005 and that VA let me fall through the cracks and he would put that in his report. So I feel that I will get sc for TBI. Am I wrong for being hopeful? Stay safe Russ",
    "Response_1": "I had to go directly to records at the VA hospital, my attorney requested it under ....release of information..... and 3 months later they still wouldn't send it to him.  If you look on E-Benefits, there is no completion date for it. This a claim that has been ongoing since march 2011.  Almost all the claims that were turned down by the RO were remanded back  after it went to the BVA??.  My original C&Ps were all given by unqualified staff.  It was when the fraud was  on the local news that my claim was immediately returned.  I was then sent to an outside contractor for my C&P and he mentioned all the declined claims in his evaluation. I was told when I called the VA to inquire about the status that I am to have 5 more C&P again, and my claims have been moved from administrative review to gather of evidence once again. My file was moved from the RO in Milwaukee to temporary at the RO in St. Paul   I am on the remand merry go round like so many mention.  I hope this helps",
    "Response_2": "well, you should get a copy of ur C&P and post it.  was it done by VA or contracted out.",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 49,
    "Question": "I'm new to this site. I was medically discharged for post concussions syn grade 3. I am having serious issues dealing with memories issues, getting into trouble with law, can't concentrate, throwing up for no reason. I was put out of work due to my ptsd's issues. I filed for an inc, but was denied. My shrink stated that I was dangerous, unpredictable, a threat in the work force, and I will never be able to work again. \n\nThis antipsychotic meds have me not believing in God anymore. I'm like a zombie all the time. I'm just lost right now.",
    "Response_1": "Sorry to hear of your hard times bud. I see that you are 100% VA already. What exactly are you asking for looking for? I also have TBI due to 6 concussions in service, and recently had a Brain Scan and was diagnosed with PCS as well. Along with the PTSD, life has been very hard, but I have a great wife and kids. Do you go to VA for Trauma Counseling or Treatment? Is there support for you within your family? Good luck and please keep us posted",
    "Response_2": "I was thinking if I qualified for smc benefits, due to the residuals from tbi. However, the va has a history of tying ptsd symptoms with tbi's recipients. I had a tbi exam, and it was the best tbi exam I ever had. My exam was a Dr looking into the computer reading my history, asked me to remember three words; I could not remember those words. He tells me to stand up and close my eyes with both arms spread apart, and that was my perfect exam. Telling you beautiful people the truth.",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 50,
    "Question": "I got whacked in the head while in the service and lost consciousness. Several months later my military medical records I was being treated for chronic headaches with migraine like symptoms though the medication I received looked like it was for tension headaches. Last military records shows me complaining of a dull headache.\n\nThat was 1983. I never knew about applying for anything with the VA and for the past 30 years I�ve been seeing civilian doctors for chronic headaches, memory loss, insomnia, but mainly for the bad headaches. A CT scan showed a brain cyst on the left side and I�m currently still being treated.\n\nShould I be looking at this as a TBI? I did apply for compensation for the chronic headaches but I got denied as they said there was no current diagnosis so I was wondering if I labeled it wrong.",
    "Response_1": "Do not do the TBI, a part of the 900 code for the reg on TBI has them max at 10% under TBI. What did your doctor call them? Send in the NOD stating that the service called them a migraine type headache DC 8100. you will have to also say how many per month, how much time lost from work and if you needed bed rest.",
    "Response_2": "My dad was thrown from a gun jeep in 1978 he is now receiving 100% for a TBI injury I would file for a TBI rating ASAP.",
    "Response_3": "Folks remember this one important point. I know these new TBI regs sound good. The SMC is great for deserving veterans. Now as far as past injuries that happened inthe 80s, If you had an injury and say you filed a claim and were denied. You could re open the claim based on New and Material Evidence but I stress the regs in effect at the time of the original decision will take precedence.",
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 51,
    "Question": "So today I went to this C&P exam for my TBI increase (currrently rated 10%, decreased from 40% which I had earlier). I'm already diagnosed with TBI after IED and a suicide bomber.\n\nAnyway, so I sat infront of the Doctor waiting for him to ask me anything. For 20 minutes he didn't say anything, he was just reading my medical notes on his screen. Then he asked me, what about your dizziness when did it start? I told him a week or two after the incident. He told me no, not true!!! I was like WHAT!!?? He said not true. I was really surprised as I didn't expect to say this.\n\nHe didn't ask me anything more about my dizziness he was about to continue reading when I told him that I went to ENT specialist outside the VA and he told me that my dzziness is related to my ears, I gave the papers that I got from the ENT clinic. He looked at them and then he gave them back to me. He told me, this is nothing, there is no diagnosis and no medication mentioned here. Ofcourse the diagnosis was there (menier's disease) but he chosed to ignore it. Then I told him here are the medication (Dyazide and Diazepam). He said no doctor will give this for dizziness. After that I decided to stop arguing with him.\n\nHis next question was about my headaches, he asked me if I have any headaches. The answer was yes. How often? The answer was more than once a week. He replied more than once a year? NO, more than once a week. More than once in two months. NO, more than once a week. I think he was paying stupid or something because then he asked if I said more than once a month, and I answered no sir, it's more than once a week like six a month.\n\nHe asked about medication, and I, again, showed him notes from a private neurologist, which mentioned Hydrocodene and Gabapentine 600mg 3 times a day for migraines. He did the same thing again, he said no neurologist will give Gabapentine for headaches and it's given for tingling. I told that's what the specialist gave me.\n\nThen he said we are all done. No physical exam and no any other kind of exam. That's it, it took about 40 minutes .\n\nSo can anyone tell me what to do now and how to proceed from here. I think I lost my claim for dizziness and there is no way that I can appeal it, or reopen it. Any advice will be highly appreciated.\n\nThanks and sorry for this long post",
    "Response_1": "I just took 6 c&p exams in order to increase my tbi rating. It's hit and miss when it comes to c&p exams... you just have to be wait and see until you get your c&p results.\n\nAlmost all of us have some type of bad experience with c&p examier.",
    "Response_2": "Wow that is awful. I thought my husbands TBI exam was the worst but yours sounds even worse than his was!\n\nWas this a VA doctor or a outside contractor?\n\nWhy do you say there is no way you can appeal or reopen your claim?",
    "Response_3": "To clarify, At this appointment were you there for three separate issues?\n\n1. Increase already Service-connected TBI\n\n2. New claim for M�ni�re's or dizziness\n\n3. New claim for migraines\n\nYou can appeal ANYTHING with the VA! As a wise member on here- john999- posted once, he would appeal it if VA made him King for the day! ha ha\n\nJust remember when you're appealing or asking for a reconsideration with New and Material evidence, the goal is to specifically dispute the reasons they denied you. For example if they deny you because the doctor did not give you a diagnosis, then go to a doctor get a diagnosis and submit that. Or If they deny you because there's no Nexus statement a.k.a. a connection between your military service and your current diagnosis--Then go to your own doctor and get that Nexus statement where the doctor says your current diagnosis was most likely caused by the military.\n\nGetting those DBQ's is a great idea! But if these issues are not service connected yet --you absolutely have to tell the doctor to write the Nexus statement on the DBQ in the Remarks section.",
    "Response_4": "C&Ps are a game and you may have a positive outcome in spite of what you feel is a bad C&P.\n\nThat being said, my last C&P sucked and I got bad results now under appeal.\n\nGood advice above; assume the worst and prepare countering evidence and present it all in a simple format on Form 21-4138 http://www.vba.va.gov/pubs/forms/VBA-21-4138-ARE.pdf\n1 person likes this",
    "Response_5": "I understand your sentiment. Sometime the C&P seems like a platform for the VA to deny claims. I am no expert on the VA claims process, but logic would tell me that a C&P like that would possibly yield a CUE or perhaps may be easy to rebut. I agree with NavyWife but in my experience getting those Nexus and also a doc to say that there is a connection with your disability and your time in service could be next to impossible. Not sure but maybe the doctors have been give directives to avoid providing those, maybe because they don't have the necessary credentials or may be to avoid liabilities. In either case you could also search this forum for IMO, which in y opinion provides some of the most comprehensive information I have come across online.\n\nDo your own research in order to \"avoid becoming another victim/denial in the percentage rate game\". I started at 20% and I am currently at 70% after almost 20 years and the only reason why it took so long was because I felt helpless every time they denied me only to open the claim at a later date and get approve and compensated for less time that I deserved.\n\nGood Luck,"
  },
  {
    "Question_id": 52,
    "Question": "Jus curious if any vet with tbi n other conditions has gotten smc.",
    "Response_1": "I got my BBE Friday I am service connected for TBI at 0%",
    "Response_2": "yes i have SMC at the S-rate ..exactly what are you looking for????",
    "Response_3": "I have 100% TBI + SMC S. I am in the process of being assigned a fiduciary as well because my math skills are non existant.\n\nFound out I may be eligible for SMC T because my poor short term memory and low executive brain funtions keep require that I have supervision for meds, meals, scheduling and everything I do outside my apartment. My caregiver has read all she can about it and I fit the eligibility profile well, but getting my psych to fill out the form 21-2680 has been near impossible! It is recommended that he also write up a report stating that I will need to be in assisted living if i don't receive daily in home care. He has had the form and written request for 5 weeks. I won't submit a claim without this very important evidence. My VA records will support everything they need to look into afterward.\n\nSo, I would also like to know...Any vet out there been rated with the SMC T?",
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 53,
    "Question": "Jus curious if vets are aware of the new smc t rating for tbi n residuals. It seems like some arent. I just learned about it. I'm awaiting a decision by the va. I've read requirements for t rating. Seem justifiable but I know the va doesn't want to pay vets at that rate. It's 7900 a month. Funny my psychiatrist from the va told me the va doesn't want to pay the t rate. Amazing. I've seen him.for 7 yrs. He's a decent dude tho. He did my 21-2680.",
    "Response_1": "I never of this benefit before as I have been service connected for TBI as well but I have a 0% rating. I received 50% from headaches but it was rated separate from the TBI! I will look into this to see if I qualify for this benefit. Thanks for the info.",
    "Response_2": "Yes, it's a great benefit for those with a TBI rating. Essentially you would need a doctor to write a statement that you would need care similar to a nursing home.",
    "Response_3": "I have 100% TBI + SMC S and am in the process of being assigned a fiduciary because I can't handle my own finances.\n\nWhen I left the Martinez TBI clinic after a month of assessments and tests, the head psych said that without my cargiver assisting me on a daily basis, I would need assisted living and said he'd help me get A&A. However, the staff stated that since I served during peacetime and am not missing any limbs, I was not eligible. They are used to the A&A given as a pension and not at all familiar with SMC T, which is given as compensaion and has different eligibility standards. Although the fast letter for it was created in 2013, it is still so new that most people haven't heard of it.\n\nIn Jan my VSO told me about the SMC T raitng and said I should be eligible because my poor short term memory and cognitive decline require that I have supervision for meds, meals, scheduling and everything I do outside my apartment. I fit the eligibility profile well, but now that I'm out of the TBI clinic (which is 2 hours away) getting the dr to fill out the form 21-2680 has been impossible! It is also recommended that the dr write up a detailed report stating that I will need to be in assisted living without daily in home care. I've sent an email with speicifc information and the form 5 weeks ago....And he has not done anything! Each week the dr's assistant states the dr is \"Very busy, but working on it\". My caregiver sent another email, this time through MyHealthevet because the dr supposedly HAS to respond within 3 days. Nothing. Today we went to a patient advocate, who is unfamiliar with the SMC T rating and this form of A&A, but put a note in the system to the dr and his assistant that we are anxiously waiting for the papers to be completed. So, at least there is something on record. Any ideas on what else we can do to get the doc moving? We've never had such a hard time communicating with a doctor!\n\nCrazy Horse, you are the only vet we've come across who has even started the process for an A&A for TBI claim. How long has it been and what has happened since you submitted the 21-2680?",
    "Response_4": "I have a Nod in and am having a dro decide. My psychiatrist did my 21-2680. I'm hoping I get the smc (t) rate. I have a tbi rating with residuals from getting shot in my grape. Bottom line is many va doctors don't want to write it up when they know a vet rates it.",
    "Response_5": 0
  },
  {
    "Question_id": 54,
    "Question": "Last year, my claims were approved and I received a combined evaluation of 80% due to (PTSD - 50%, TBI - 40%, Migraines - 30%, Tinnitus - 10%). Recently, I received a letter stating that they had made a clear and unmistakable error and will reduce the TBI to 0% and my overall will go to 70% after an Admin Review.\n\nI understand their reasoning since they feel the symptoms are overlapping and they can't apply my TBI facet levels that are higher than 0 towards TBI since they've already supported the 50% evaluation for PTSD. Where I disagree (potentially) is that I have other residuals that aren't \"psychological\" and are attributable to my other evaluations (e.g. Migraines).\n\nThe items/residuals that might still apply are subjective complaints of balance problems and vision changes (TBI residuals) that I don't think the doctor evaluated correctly at a 0 severity level. I have blurred vision, balance problems and hypersensitivity to light that do interfere with work, daily living, etc. I wasn't worried before when I got my evaluation because I thought what I had received was fair...but now they're attempting to reduce.\n\nMy VSO suggested I show the letter to my Mental Health doctor and see their opinion (and see if they'd like to write up documented opinion for me) and then try to request a hearing or denial.\n\nAny suggestions?",
    "Response_1": "The VA is trying to lump TBI and PTSD together. That is in it self a fraudulent activity as a TBI is a Trauma of physical nature to the brain. PTSD could be a result of that Trauma but items like gait, coordination and headaches are from the sustained trauma. Stand Alone PTSD is only and I say only a guess by a Phyc Doctor. Does anyone see the bull in this crap the VA is trying on you.\n\nA case need to make it to the federal court to get a porecedent setting opinion of a final nature as the VA will continue to bullddoze veterans over with this crap.",
    "Response_2": "Your VSOs advice sounds good.\n\nAdditionally, I would file for an increase to try and get the ptsd bumped up to 70 and the migraines to 50, if you think that you meet the higher evaluation. That would put you at 90 combined. Personally, I don't think the va will back down on this reduction, but ya never know.\n\nReview the rating schedule here for PTSD & migraines\n\nhttp://www.ecfr.gov/cgi-bin/text-idx?rgn=div5;node=38:1.0.1.1.5",
    "Response_3": "Since this is a decision, if you dispute it, you need to file a NOD within one year.\n\nLike other NODS, you should focus on their \"reasons and bases\" for decision and demonstrate where that is in error.\n\nDont try to tell them you are sick, need the money, etc., etc...just refute their reasons and bases. Most importantly, look at the rating criteria for TBI and PTSD...\n\nSuggest if they made an error on the initial decision, it is likely that they could make an error on this one, too.\n\nYou blacked out the dates, and that is important. You said the decision was \"last year\"...was it more than a year ago?\n\nRemember a decision becomes final in a year and the burden is on the VA to prove CUE, IMHO.\n\nYou should respond with 2 words, \"Prove it\" (Remember the criteria for CUE is very strict...look it up..it has to be undebatable...it has to manifestly change the outcome (outcome determinative) and it has to be based on evidence the VA had at the time. \"new evidence\" changes the picture in regard to CUE. Since they alleged Cue, be sure and read up on CUE..there is much here about it. You could still argue BOD because you dispute CUE.",
    "Response_4": "you're right in that I think I should focus on the symptoms that can't be attributable to PTSD or other awarded disabilities like blurred vision, balance, and hypersensitivity to light, etc that should be documented in my file. Only problem is I don't that facet level was rated accurately by the neuro - I think she was focused more on the psychological manifestations.",
    "Response_5": "If this is a proposed reduction the letter should have given a time frame in which to request a hearing.Then you can gather\n\nASAP any medical documentation that proves them wrong.\n\nDid your rep suggest asking for a hearing?"
  },
  {
    "Question_id": 55,
    "Question": "I received a TBI in March of 1966 was in the hospital two days and had a Grand Mal seizure. I was put through all of the tests available at that time. I was sent to nuero ward in Germany and retested all the same tests and a few more. I was released from hospital with a med. profile that basically said I could do nothing. The tests never `showed a problem, but the seizures continued. I have had headaches and a few other problems since discharge in 1968. Do you think I have a claim?",
    "Response_1": "If you have never filed a VA claim before, it would be good to get a copy of your SMRs and subsequent private medical records.\n\nAlso ask for a copy of your 201 (Personnel file)\nNARA on line is where you can request those records.\n\n\"was released from hospital with a med. profile that basically said I could do nothing\" Could you elaborate? I mean, you did continue Active duty???until 1968?\n\nWas that a Military med board discharge?\n\nDo you have proof that the TBI occurred? Was a concussion documented?\n\nTBI testing in the 1960s is nothing like it is today.\n\nIf you have had continuous seizures and treatment for them since service. would your private doc (if you arent a VA PT, be willing to give an opinion that the seizures stem from the TBI that caused the Grand Mal seizure ?\n\nWe have info in our IMO forum on that as to how the opinion should be worded.",
    "Response_2": "Berta is on the money bud. Sorry to hear about your health. I was just diagnosed a few weeks ago with Micro Seizures apparently while I sleep, and now I am on Meds. I too down the road I guess will submit a claim. God Bless and keep us posted.",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 56,
    "Question": "Hello all, I am pretty new to this site. I just received my denial letter for tbi and headaches secondary to tbi. I take two meds for my headaches prescribed by va neurologist and have been seeing va speech path For help my memory problems. I was denied because they said I didn't have a diagnoses of tbi, I do however have a diagnosed of post concussion syndrome. From what I have read the two are the same thing or am wrong?",
    "Response_1": "Sounds like a good plan.\n\nBe sure to get a DX of TBI from that neuro doc that provides an\n\n\"at least as likely as not\" or \"more likely than not\" related to active duty,\n\nand how they are related.\n\nTake your service medical records and all evidence for the doc to review\n\nand be sure they state in the opinion that they reviewed them and support\n\ntheir opinion with full medical rationale.",
    "Response_2": "Yes the two are basically the same thing. I have seen several vets run into the same problem as you.\n\nLike carlie mentioned, you will need to get a diagnosis of TBI. Either from a VA doc or from a private doc. Try to see a neurologist if possible. Is it a possibility to see the same doc who diagnosed you with the post concussive syndrome and discuss with them that you feel it is a TBI? It sounds like you are already seeing a neurologist through VA for the migraines. Can you schedule an appt. with him and say, \"I would like to be evaluated for TBI\".\n\nOnce you get the diagnosis, then you can just file a FDC request to reopen (reconsideration) & include the diagnosis and again include the info regarding the IED or other incidents you believe caused the TBI.\n\nWhat about going to a VA polytrauma center? They can evaluate and diagnose TBI.\n\nTBI is one of the most complicated things you can file for. Lately, VA has been combining the ratings for things when vets have a TBI, instead of giving 2 separate ratings. For example, they have been combining PTSD and TBI or TBI and migraines. Just something to be aware of. If the symptoms are not pyramiding and can be clearly separated, then they are supposed to be separate ratings.\n\nIf you don't want to go to all this trouble to get the diagnosis, another option would be to submit articles that say that TBI and post concussive syndrome are essentially the same. A doctor's note stating this would make the case even stronger.",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 57,
    "Question": "Hi everyone.\n\nI was awarded 40%.TBI back in 2009.\n\nI put in for depression at the behest of my physician and was just awarded 70%\n\nIt would have brought my total points to 95 so I was really happy until I read the rest of the decision.\n\nEssentially, they cited \"pyramiding\" and erased my TBI, which really screwed me.\n\nDoes this sound right? I thought that rule was for multiple MH contentions that overlapped, but how do they site pyramiding for a physical injury with an MH?\n\nDo I fight this or is this a normal thing?",
    "Response_1": "They did the same thing to me, but my issues were GERD and IBS, even though they are on the opposite end of the digestive trac t. The TBI still exists, but the rating was overridden with the higher 70% rating. It's not like you would lose any special benefits of being a TBI patient. It does kinda does suck because 40% + 70% would have come out to an 80% combined rating. If you are not able to work, an option worth taking would be IU because you have a single rating >= 60%, which if granted could put you at 100%.\n\nSomeone else with more expertise should be able to help.",
    "Response_2": "I've seen this done with TBI and PTSD however I've never seen it done with depression and TBI.\n\nThe answer lies in your C&P exam. Towards the top there is a question that says something like, \"Can the symptoms be separated\"? If the Dr. marked \"no\", then maybe it is reasonable that VA would combine them. However if the Dr. marked \" yes\", Then VA made an error in combining them.\n\nYou should probably look at BOTH your TBI C&P exam and your depression C&P exam.\n\nTBI is one of the most complicated contentions that can be rated. Very frequently there are errors made. some regional offices make errors on 50% of TBI cases and some as high as 90% error rate.\n\nIn CFR 38 it says this under the TBI rating:\n\n\"Note (1): There may be an overlap of manifestations of conditions evaluated under the table titled �Evaluation Of Cognitive Impairment And Other Residuals Of TBI Not Otherwise Classified� with manifestations of a comorbid mental or neurologic or other physical disorder that can be separately evaluated under another diagnostic code. In such cases, do not assign more than one evaluation based on the same manifestations. If the manifestations of two or more conditions cannot be clearly separated, assign a single evaluation under whichever set of diagnostic criteria allows the better assessment of overall impaired functioning due to both conditions. However, if the manifestations are clearly separable, assign a separate evaluation for each condition. \"\n\nhttp://www.ecfr.gov/cgi-bin/text-idx?rgn=div5;node=38:1.0.1.1.5#38:1.0.1.1.5.2.116",
    "Response_3": "In my situation, I have PTSD and a slew of other mental conditions grouped together, but my TBI is rated with Migraines at 30%, witch is totally off the wall. I too have Crohn's, Baretts, and GERD all rated as 30% for Crohn's. You really never know with the VA. The VA wonders why there system is so off track, look at how the Raters seem to rate Vets disabilities different in each case, and group others that don't make sense.",
    "Response_4": "Also compare both of your C&P exams and see exactly what symptoms they marked you for on the TBI, which gave you the 40% rating. If it is for the same symptoms that you have for depression then it makes sense that they would combine the rating. However if it is for different symptoms, then they probably made an error.",
    "Response_5": "I think you should be made aware of this, concerning TBI and Depression:\n\nSecondary Service Connection for Diagnosable Illnesses Associated With Traumatic Brain Injury\n\nhttps://www.federalregister.gov/articles/2013/12/17/2013-29911/secondary-service-connection-for-diagnosable-illnesses-associated-with-traumatic-brain-injury\n\nAs best as I understand this, if it is a secondary service connection, they should be required to rate it separately. How else would it be \"Secondary SC\"?"
  },
  {
    "Question_id": 58,
    "Question": "When I was deployed, I had a humvee accident, that led me to falling off and hitting my head on the ice ground.\n\nI never told anyone about this incident because my seargent asked me not to, so its not in my medical records.\n\nEver since then, I've been acting wildly, and i was kicked out for abusing drugs. General discharge under honorable conditions\n\nWithin a year of leaving the army, i had a seizure and developed psychosis.\n\nI was treated for the psychosis at the VA, but didn't realize I had a seizure then until a few months ago. I found my medical records for my seizure, and even contacted a a fellow soldier who witnessed the humvee accident\n\nCan i still get my discharge changed to a medical? Do I have any just grounds?",
    "Response_1": "It is a long shot bud. Basically you would have to go back to the Military, let the Med Docs evaluate you there, then you would go thru a Med Board process and so on. I will tell you this bud. I am currently rated thru the VA for TBI, and I was Medically Retired from the Navy last year. Not for TBI though, I was retired for Crohn's and PTSD. So in my opinion, I think that it would be a very long shot bud. Sorry to hear of your troubles. Good luck",
    "Response_2": "I think the advice from Notorious Kelly offers the only chance you have of service connecting your injuries.\n\nYour situation is a perfect example of why military personnel should always seek treatment for medical problems and also get copies of their SMRs prior to discharge. Sounds like your Sergeant was trying to cover his butt rather than looking out for the best interest of his subordinates. He would fit right in as a VA employee. JMO\n\nGood luck to you and thank you for your service.",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 59,
    "Question": "Do I have a TBI?\n\nI have damage to my brain. I have documented structural damage, encephalopathy, and cognitive dysfunction. That is a fact. It is evident in MRIs, EEGs and neuropsych testing (from DoD, VA and IMEs) all show it definitively.\n\nThe problem is that the definition of TBI seems...squishy, to say the least. According to CFR 38 I have all the dysfunctions of TBI. But I don't have a VA/DoD document that says TBI.\n\nI was not in a blast. I did not hit my head. I was not punched, hit, or shaken.\n\nI had swelling in the brain (an external force?) from excess water in there (cerebral edema). This was an acute event. Afterwards, I had seizures and was in a coma for 36 hours.\n\nI am VA rated for many of the post TBI secondaries. I have seizures, memory loss, depression, anxiety, migraines, etc. But VA considers the seizures as primary and everything else as secondary to the seizures.\n\nBut at a C&P the doc said \"you do not have TBI.\" My DoD medical records and even VA records definitely show damage to my brain. Dr Bash says in an IMO I had a TBI.\n\nSo what is the official definition of a TBI? Who gets to decide if it is a TBI or just damage to the brain...and what the hell is the difference?\n\nVA says my depression anxiety and migraines come secondary to my seizures. Can I argue that everything, including the seizures, come secondary to TBI? And if I can argue that how do I make the case to VA?\n\nThanks,",
    "Response_1": "I am not a TBI expert, but what if you had an injury to your head a long time ago and totally forgot about it? Going through your service treatment records might help shed some light on it. I did not realize that some of my doctors just flipped the page over and wrote on the back of an existing page. The note I found made a big difference. It might be similar to finding a needle in a haystack, but sometimes it is best to take your time and double-check to be sure nothing was missed.",
    "Response_2": "Dr Bash says in an IMO I had a TBI.\"\n\n\n\"Definition\n\nTraumatic brain injury (TBI) is a nondegenerative, noncongenital insult to the brain from an external mechanical force, possibly leading to permanent or temporary impairment of cognitive, physical, and psychosocial functions, with an associated diminished or altered state of consciousness.\n\nThe definition of TBI has not been consistent and tends to vary according to specialties and circumstances. Often, the term brain injury is used synonymously with head injury, which may not be associated with neurologic deficits. The definition also has been problematic with variations in inclusion criteria.\n\nFor excellent patient education resources, see eMedicineHealth's patient education article Concussion.\"\nhttp://emedicine.medscape.com/article/326510-overview\n\nDr.Bash did 2 Great IMOs for me years ago. What did Dr. Bash state was the cause of the TBI?\n\nSomething caught Dr. Bash's attention.to diagnose TBI. Have you asked him about that?\n\nBut I have a question...\n\nwhat do you seek to attain if the VA concedes that uyou do have a TBI?\n\nBrain damage ,as well as TBI definitions can cover a vast amount of situations.\n\nI had an Army husband with a brain tumor and the surgeon said the tumor removal, like any brain surgery, caused some degree of brain damage, and the tumor itself had already created damage as well.\n\nThen again my USMC Vietnam vet husband had brain damage due to multiple transcient attacks and a major stroke ( 1151)\ndue to VA health care itself.\n\n\nCerebral edema almost always is due to a blow to the head or a fall on the head. But if you google cerebral edema, many potential causes will pop up.\n\nI regret it is raining hard here and my satellite dish will fade out soon , cant post any more links from, google....\n\nI know you would want to know the exact medical cause of your disability but my question regards what a different classification of their diagnosis could benefit you, as far as VA comp goes.\n\nAre you employed?\n\nIf not when you hit the 70% did the VA properly consider you for TDIU?",
    "Response_3": "TBI means to me that your brain was damaged to some extent from an external blow to your head of some sort. If you had water on the brain then how did that happen? If you could show that some force caused the water on the brain then I think that it would be a TBI. Did you ever have heat stroke? If you had some disease that caused your brain to swell I don't think that is TBI. What is the exact definition of TBI? If you slipped and fell or were punched in the face that could result in a TBI. My wife slipped and fell and the doctors checked her for a TBI even though she just cut her lip and chin. TBI is such a knew field of medical inquiry. After WWII thousands of military were released with TBI, but they had no concept of what it was and thought that as long as you did not show gross symptoms you were fine. After Vietnam it was the same deal. Only after OIF/OEF did the military begin to really pay attention to TBI where there was not concussion from bomb blasts. The experssion shell shock is slang for TBI before it was understood a little bit. I don't think VA understands it fully now.",
    "Response_4": "I am rated for TBI, and I had to go thru a series of Brain Scans and see a Neurologist thru the VA. The whole process took a few months to diagnose. Have been rated 30% for TBI/Migraines ever since. I am sorry to hear of your troubles and truly wish you the best.",
    "Response_5": "No it is not a TBI the way that VA & DOD defines it.\n\nhttp://www.ncbi.nlm.nih.gov/books/NBK189784/\n\nAPPENDIX CDEFINITION OF MTBI FROM THE VA/DOD CLINICAL PRACTICE GUIDELINE FOR MANAGEMENT OF CONCUSSION/MILD TRAUMATIC BRAIN INJURY (2009)\n\nGo to:\n\n1.1. Definition of Traumatic Brain Injury\n\nA traumatically induced structural injury and/or physiological disruption of brain function as a result of an external force that is indicated by new onset or worsening of at least one of the following clinical signs, immediately following the event:\n\nAny period of loss of or a decreased level of consciousness (LOC)\n\nAny loss of memory for events immediately before or after the injury (post-traumatic amnesia6)\n\nAny alteration in mental state at the time of the injury (confusion, disorientation, slowed thinking, etc.) (Alteration of consciousness/mental state5)\n\nNeurological deficits (weakness, loss of balance, change in vision, praxis, paresis/plegia, sensory loss, aphasia, etc.) that may or may not be transient\n\nIntracranial lesion\n\nExternal forces may include any of the following events: the head being struck by an object, the head striking an object, the brain undergoing an acceleration/deceleration movement without direct external trauma to the head, a foreign body penetrating the brain, forces generated from events such as a blast or explosion, or other forces yet to be defined.\n\nThe above criteria define the event of a TBI. Not all individuals exposed to an external force will sustain a TBI, but any person who has a history of such an event with immediate manifestation of any of the above signs and symptoms can be said to have had a TBI.\n\nThe external force would have to come from outside of the body.\n\nI don't see any benefit to you in pursuing this. It might be a better use of your time to try to get your current ratings increased if you feel they should be higher. Or pursuing TDIU if you are unable to work due to your service connected disabilities.\n\nSorry you have to go through this. I understand how hard it is living with seizures."
  },
  {
    "Question_id": 60,
    "Question": "Hi all is there a DBQ for TBI and where can I find? Thank you.",
    "Response_1": "Hi,\n\nNo, there is not a DBQ for TBI. VA has DBQ's for most issues but they do not allow one for TBI.\n\nHere's a few things you can send to VA for your TBI claim.\n\n1. Copy of the pages from your service treatment records showing the incident that caused your TBI. If that is not available then some type of proof such as a buddy statement.\n\n2. It's not absolutely necessary to have a diagnosis of TBI. However if you can get one, then do so and send a copy of those records.\n\n3. A short statement from the veteran stating when and how the TBI occurred as well as what TBI residuals are affecting him now such as memory issues, lack of concentration, unable to use navigation systems, poor judgement, etc.\n\nHave you filed already? been denied? Or haven't filed yet?",
    "Response_2": "Yes have been denied. I started a topic called post concussion syndrome vs tbi. I need to put a game together for an appeal. Once again thank you.",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 61,
    "Question": "I have a TBI rating of 10% amongst other things. I know that a while ago the military started granting Purple Hearts for a TBI injury. Has anyone been sucessful in getting the Purple Heart Award for TBI? I'm currious about the process.\n\nThanks",
    "Response_1": "I don't see it happening, anymore than awarding a PH for PTSD. (jmo) I believe one of the requirements is that you shed blood. Good luck, tho!",
    "Response_2": "Got this off the net. Reading the entire entry this injury must be caused by \"enemy action\" ie you don't get one if our own ammo dump blew up of its own accord. PTSD is specifically excluded from being an injury for award of PH. Hope that helps.\n\n(4) Examples of enemy-related injuries which clearly justify award of the Purple Heart are as follows: \n\n(a) Injury caused by enemy bullet, shrapnel, or other projectile created by enemy action.\n\n(b) Injury caused by enemy placed mine or trap. \n\n� Injury caused by enemy released chemical, biological or nuclear agent. \n\n(d) Injury caused by vehicle or aircraft accident resulting from enemy fire. \n\n(e) Concussion injuries caused as a result of enemy generated explosions.\n\nAdded link later:The text has been cut and pasted for ease of reading & applicability. To see the text in full from AR 600-8-22, 25 February 1995 and Public Law 104-106 - Feb. 10, 1996 visit http://www.usmcvta.org/pheart/phcriteria.htm",
    "Response_3": "You brought up a point bud. I have TBI due to 6 Concussions from numerous IED, explosions etc. I did not receive a Purple Heart, then again I am not your typical Vet that wanted any of that stuff. It does get my brain going though. Good luck and keep us posted.",
    "Response_4": "soldiers should be honored for what theyve suffered/ I know when I see a purple heart license plate I tthink abt what the driver may have suffered and would surely stop to help if I saw that plate or any DV plate/",
    "Response_5": 0
  },
  {
    "Question_id": 62,
    "Question": "My MH claim just completed. I. Needed a 70% rating to get 100% schedular. I got the 70%, but they erased my established 40% TBI rating. (Listed it as part of the MA contention) I thought MH issues where rated separately.\n\nBe warned! These guys are slick.",
    "Response_1": "The VA does not allow in their words \"Pyramiding of Similar Conditions\". For example I have PTSD, Depression, OCD, Anxiety and Insomnia and the VA groups all these as 70% SC for PTSD. Now my TBI is rated with my Migraines as 30% SC for Migraines. I have Crohn's Disease, Barrett's Disease, GERD and Ulcers and they are all grouped as Crohn's SC 30%. Sorry bud, but this is very common for the VA to allow an Increase, but to include all similar conditions.",
    "Response_2": "If you want you could post what is stated from the Reasons and Bases Section of the decision\n\nand other's can check it out.",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 63,
    "Question": "Recently diagnosed with Parkinson's and I am trying to link it back to a TBI I received back in 1986. Looking at the medical records it is going to be hard to justify a moderate TBI from them. Would witness statements help?\n\nI have never filed a claim before and I met with the DAV VSO this morning who gave me a list of records and information that he needs to file.\n\nAny tips on what I should be doing to get my TBI rated at moderate and the Parkinson's linked to it?",
    "Response_1": "I suggest you read the TBI info here at hadit.\n\nParticularly this:\n\nIn Part:\n\n\"B. Summary of Major Provisions\n\nThis final rule revises 38 CFR 3.310 to provide that, absent clear evidence to the contrary, five diagnosable illnesses �shall be held to be� secondary results of TBI in certain circumstances. The identified circumstances pertain to the severity of the TBI and the period of time between the TBI and the manifestation of the secondary condition. Specifically, paragraph (d)(1) of the rule provides for secondary service connection of the following illnesses: (1) Parkinsonism, including Parkinson's disease, manifested following moderate or severe TBI; (2) Unprovoked seizures manifested following moderate or severe TBI; (3) Dementias of the following types: presenile dementia of the Alzheimer type, frontotemporal dementia, and dementia with Lewy bodies, if manifest within 15 years following moderate or severe TBI; (4) Depression if manifest within 3 years of moderate or severe TBI, or within 12 months of mild TBI; and (5) Diseases of hormone deficiency that result from hypothalamo-pituitary changes if manifest within 12 months of moderate or severe TBI. If those conditions are met, the secondary condition will be service connected and considered to be part of the service-connected TBI for purposes of providing VA disability benefits.\"\nVA rates TBIs under the residuals they cause .\n\n\"I am trying to link it back to a TBI I received back in 1986.\" Is that clearly noted in your SMRs?\n\nIt might take a strong independent medical opinion to support this as a secondary conditibn, due to the lapse of time since 1986.\n\nYou need to obtain all SMRs, any VA med recs and any private medical records.",
    "Response_2": "I am rated for TBI/Migraines 30%. Just make sure you get all your notes and evidence together before you submit a claim. Hopefully you get rated for the TBI first and then down the road get well documented thru the VA for treatment, then submit for Parkinsons as secondary to TBI. My best friend of 26 years is only 32 and he has had MS and Parkinsons since he was 15 years old, so I feel for you. God bless and keep us posted.",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 64,
    "Question": "I put in a claim for migraines, my first c and p was with the neurologist, and he wrote down everything I stated, he put down the criteria that meets the 50 percent rating for migraines ( completely prostrating ). He even linked them to my stressor with an at least as likely as not statement. But I had another c and p with an ignoramus doctor who wrote my migraines were severe but not prostrating, he screwed me and wrote everything opposite of what I told him. I have been treated at the va for my migraines and I have a lot medication for them in my va records, my question is are they going to take the neurologists recommendation which states the 50 percent rating criteria, or the other c and p opinion that said I don't have prostrating migraines. And should I file a nod if low balled or denied, Thank you everyone for chiming in.",
    "Response_1": "It's a wait-and-see, I'm afraid. One would think they'd take the opinion of the neurologist. But I wouldn't count on it.\n\nIn order for migraines to be at the 50% level, they have to be \"with very frequent completely prostrating and prolonged attacks productive of severe economic inadaptability.\" That's not well defined, but the 30% level is prostrating once a month.\n\nBe prepared to submit a NOD. But one never knows.\n\nI'm in the process of crafting a NOD to address my migraines being lowballed at the 30% level.\n\nGod bless!",
    "Response_2": "It's not like you don't have any recourse. If you have medical records that show otherwise, that's a substantial pile of proof. Be ready to stand on that. If you can, get outside medical opinions. However, you'll have to wait for your claim to close to see what was denied or lowballed before you really take that next step.",
    "Response_3": "You will have to wait and see, and be prepared to appeal if necessary. The fact that you have medical evidence in support of your claim and a Neuro exam in support of your claim will help a lot.\n\nI am sorry you have to deal with a totally inaccurate C&P.",
    "Response_4": "I am 30% for Migraines/TBI and I should have been rated at the 50% level too. I just put in for an increase yesterday. I get 21 injections in my head every 3 months, and I take the strongest Prescription for Migraines you can get. I just did not want to fight the % last year, as I was working on my SSDI claim and other VA claim. Now that I am 100% VA, and granted SSDI , now I am going to fight a few of the smaller fights. God Bless and good luck",
    "Response_5": 0
  },
  {
    "Question_id": 65,
    "Question": "HAVE A FRIEND THAT RECENTLY HAS BEED RATED AT 40% FOR TBI. HE HAS OTHER COMPLICATIONS. WANTED TO KNOW WHAT CONDITIONS ARE SECONDARY TO TBI.\n\nTHANKS IN ADVANCE",
    "Response_1": "A TBI can be a life altering event because it involves the brain. So many things can be secondary to TBI, but I will get the list started...\n\nDepression\n\nAnxiety\n\nPTSD due to the TBI event\n\nAny physical damage caused by the TBI event\n\nTinnitus\n\nScars from the TBI event\n\nSleep Apnea has been linked to TBI\n\nNeurological issues\n\nNerve damage\n\nHeadaches\n\nBlurred vision\n\nThere are also 5 recognized secondary issues for TBI including seizures, depression within a specific time frame after the TBI & Parkinson's & dementia. These issues do not need a nexus statement linking them to a service connected condition. Only the diagnosis is needed, so long as the TBI has already been service connected.\n\nhttp://legalmeetspractical.com/2012/12/26/va-recognizes-five-disabilities-as-secondary-to-traumatic-brain-injury/\n\nDon't forget with the exception of the 5 recognized secondary conditions, the vet will need a nexus statement from the doctor. Once the doc diagnoses each secondary issue, they must also state, \"the _______is at least as likely as not caused by TBI.",
    "Response_2": "hose 5 presumptive conditions to TBI currently are only a proposal. Final action to make it law doesn't tentatively go into effect until April 2014, a few months away.\n\nThe VA's criteria to qualify those 5 secondary conditions of TBI for presumptive service connection seems unduly restrictive, especially on older WWII, Vietnam and Korea era Veterans etc. who suffered a TBI when less was medically known about the sequelae of that type of injury. Veterans with \"mild\" TBIs are also going to have an uphill battle getting their secondary conditions from TBI presumed as service connected by the VA. Lots of hoops for Veterans to jump through are attached to this proposal.\n\nPlease read the proposal carefully: One of those proposed 5 presumed secondary conditions of TBI, \"Parkinsonism\" is or can be different from \"Parkinson's disease\" which it is sometimes confused with.\n\nDiabetes Insipidus ought to be added to the list of proposed secondary conditions as some studies indicate permanent DI is found in higher than normal percentages in post moderate to severe TBI patients due to posterior pituitary dysfunction.",
    "Response_3": "I was awarded TBI back in 09. I currently have a claim in for depression. I have been diagnosed with severe depression and was maxed out on thier perscription dosage for treatment. Does this mean I will win my depression claim even without a private doctor nexus? My mental health doctor straight out told me that it was secondary to my TBI, but then at my last appointment said it was secondary to PTSD, which I've never claimed. Maybe she ment depression? Anyway, I'm all kinds of confused. Don't know what my next step should be.",
    "Response_4": "It's frustrating how VA needs everything to be written in the exact way they want it or they deny it. Then when you resubmit it their way, according to their \"secret code\", they will approve it.\n\nMake sure to let him know dementia and Parkinson's are \"presumptives of TBI\". As long as he already has a TBI diagnosis, then gets a diagnosis of those (or can get diagnosed at a VA C&P exam AND he puts in for them as \"secondary to TBI\", then they should be approved. Depending on the date of his claim and the date these presumptives are included in the law, there should be no problems getting them approved.\n\nThe depression can also be a presumptive to TBI, but it has to meet very specific criteria, as mentioned in my first post.\n\nAn issue can be filed as:\n\n1) direct service connected OR\n\n2) secondary OR\n\n3) presumptive\n\nEach type of claim needs to be written in a specific way with specific evidence.",
    "Response_5": 0
  },
  {
    "Question_id": 66,
    "Question": "Hi everyone, I am new to the forum and just had an odd experience with a C&P.\n\nI have an instance of mild concussion on my c-file from 01, additionally; I had a motorcycle accident in which I was unconscious. This second TBI was not recorded because I downplayed the symptoms at the time. My CO, �had a talk� with me about my reckless behavior, as I was into action sports, i.e. freestyle skiing and motocross, and had gotten injured a few times. My performance was always great, but my off-duty hobbies were fairly dangerous.\n\nI put in for TBI residuals in 2012, and after a year completed a C&P, which included a DBQ. I am familiar with a DBQ, and read the questions before going in. I knew my responses when I went in and was honest. However, the physician seeing me did not accurately record my responses. He used extremely downplayed versions of what I said in the notes, such as �occasionally forgets names,� and �sometimes get anxious when he gets lost occasionally in unfamiliar situations.� I know for a fact that I responded that �[i struggle with getting lost, even in familiar settings, but I can use tools like a GPS. I need a GPS, even in familiar settings, i.e. my own neighborhood. ]�\n\nI respect his medical opinion that a nexus between my concussion and symptoms do not exist, but he did downplay my responses to a point where I am concerned about his professionalism. I am an educated professional myself, and my TBI does effect me, and I was sure to respond with all of my subjective symptoms. He failed to document my responses.\n\nI have some objective evidence that was entered during the polytrauma exam, and a diagnosis of TBI on my C-file. However, the C&P DBQ was not accurately recorded. I am concerned that this will impact my rating, and my claim is now with the VBA, so a decision will likely be made in the very near future. I was certain that I was qualified for 40%, but now I don�t even think I will get 10%.\n\nWhat should I do?",
    "Response_1": "I have some objective evidence that was entered during the polytrauma exam, and a diagnosis of TBI on my C-file.\"\n\n2 questions......\n\ndo you have proof of the initial inservice TBI in your SMRs?\n\ndo you have documented disabilities that you claimed as residuals from the TBI inservice,which fit into the TBI criteria here at hadit??\n\nI am curious as to what the 'objective evidence' was during the polytrauma exam.\n\nDo you have a copy yet of the TBI exam results?\n\nWe can help more if we can read exactly what the doc wrote down..\n\n\"I respect his medical opinion that a nexus between my concussion and symptoms do not exist,\"....\n\nBy concussion do you mean the initial TBI? or did he refer to the accident where you lost consciousness?\n\nWelcome here and thank you for your service.",
    "Response_2": "Are you saying he stated your accidents did NOT cause your TBI residuals? If so, then there will be no service connection-in effect, a denial.\n\nIf he did agree that at least one of your in service accidents caused your TBI and he did not write down what you said, you have the option to upload a statement to your claim through Ebenefits & ask the rater for a new exam because that one was insufficient & faulty.\n\nYou have a copy of the exam, right?\n\nI assume you are familiar with the way the rating works for this contention? They rate your percentage based not on the average of your score, but instead on your single highest score. As long as any one category is scored a \"2\", then your percentage would be 40. Likewise, if your highest score is a \"1\", then your rating would be 10%, and if your highest score is a \"3\", then the percentage would be 70.",
    "Response_3": "Can you scan a copy of your C&P exam here? Or at least copy & paste exactly what the doc wrote.\n\nDo NOT post your name or SSN or other identifying information.\n\nAlso, are you working with a VSO?",
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 67,
    "Question": "Ok it looks like I have a fight on my hands. I have medical records showing I was in an IED and lost consciousness yet I was denied TBI with an explanation that it is PTSD. Any advice on how to get them to see the TBI and not classify it as PTSD?",
    "Response_1": "Medical evidence from a MRI showing the injury to the brain.\n\nDo you have that?\n\nAn opinion from that MRI as it was read by a specialist.\n\nDr Bash comes to mind. He is a NeuroRadiologist who specializes in the Brain and Spine.",
    "Response_2": "I hope this may help. just got my VA letter today. I served in several campaigns over the last 20 years. I got knocked around a few times when I was younger. but remained Combat Effective until my 19th year, when my spine decided to take an early retirement (with a little help from James Dewar and Issac Newton) I was rated for PTSD at 70% along with 23 other ratings of various percentages for a combined 100%. Point is that while I was in-country around the K.A.A. early in '03 I had a minor LOC (about 30 minutes) for being in a place that I should have known better to not be. I was registered with the TBI registry when it started in 2008. I have Medical Record evidence at three Military hospitals. Mostly for repeated migraine. with only (1) of three MRI's showing any abnormal findings. Even with partial evidence and registry in the TBI database by my Independent Duty Corpsman.\n\nIn my VA letter the VA responded with this:\n\n\"Examiner further reports that cognitive findings are associated to the post traumatic stress disorder and not the traumatic brain injury; therefore, these symptoms will be used in our evaluation of post traumatic stress disorder and will not be considered in our evaluation of traumatic brain injury.\"\n\nI have issue with this because as my estranged wife would be the first to admit that my personality did change after my first OIF tour in 2003 and little LOC (which was not by ANY means my first or last combat zone tour). Drum roll please....Ta-Da.....The VA has slapped me with a PROPOSED INCOMPETENCE, on something I must have said during my C&P. POINT ...The VA can get away with it because PTSD is usually a DUAL DIAGNOSIS (drugs/alcohol are usually also somewhere in the picture) If they can say you are dependent or unable to handle your finances, they can deny you your back pay, and appoint someone to send your paycheck to. I do not know of many studies that link TBI with drug/alcohol dependency....It is another way of the VA trying to stick it to you. Don't fall for their BS, just because you may be rated at a high rate. if it is in-correct you should seek to get it straight. your future PTSD status could always change, but it would be a pretty tough case to prove that brain damage IS IMPROVING. I went through the DAV, but am just starting this process, have not sent my NOD out yet.",
    "Response_3": "I read your post and this is the advice I can give. Appeal. Although some TBI and PTSD items are similar, they are not the same, and the VA does mess this up alot.\n\nMy husband was receiving 10% disability after getting out of the service. We went through some very difficult issues due to his behavior, sleep patterns, migranes, and memory changing, so I told him to go back to the VA. His doctor this time sent him for an MRI (due to the migraines), and they found dead brain matter. He then sent him to a cognative skill specialist who tested him and found that confirmed as well that he had TBI (in her report). His doctor them submitted these reports, along with his theropists reports (who he had started seeing regularly due to the behavior changes, at the VA).\n\nAbout 6 months later, they came back and gave him 20% for PTSD, and 0% for TBI. Being an infantry vet, we figured he had PTSD, so that was no biggie, but I didn't understand the 0% for TBI .. he had dead brain matter! It happened to be that a few weeks later we were at the American Legion, and we started talking with a gentleman there. Of course 2 vets discuss the VA, and this came up. It happened to be that this gentleman actually helps vets do appeals, and he gave us his number (he was going home - lived out of state) and told us to contact him. A few months later, I finally convinced my husband to contact him (he was stubborn and insisted that others were better off than him, because he had my support).\n\nJohn (the gentleman), had us send all his medical info to him, and got right to work. He informed us that because TBI is relatively new, it is not uncommon for it to be \"missed\" by the reviewer, and to be honest, most times they deny the first claim to weed out the imposters. A few months later, he submitted the appeal. The appeal was submitted in July of 2011. John would call us every few months to let us know that the packet was still in the \"process\" stage with the VA.\n\nWell finally, 3 weeks ago, we got a call from the VA. The set up an appointment for an independent civilian TBI specialist to \"determine\" if he had TBI and to what extend. His appointment was this last Tuesday (8/27/2013), and it was fairly quick (a few small tests and a sit down for a few minutes). By the way, there were other vets with TBI there for appointments too, apparently he was here for a few days to go over multiple cases. The appointment was very promising overall. The doctor informed us that his determination would be to the VA by Friday (8/30/2013). Now we are just sitting and waiting.\n\nThe point to all this is that if you feel you may have TBI, appeal the decision, and requests tests from the VA (MRI, Cognative skills, etc), to help support your claim. It is not uncommon for claims to be either denied or rated extremely low at first. I am not going to lie, it is a long (years) process for an appeal, but if you truely have TBI, it is worth it. Bones heal, brain cells do not. Best of luck to you, and hang in there!!",
    "Response_4": "PTSD and TBI...please see this link to a 2010 BVA case that indicates service connection for both can be granted:\n\nhttp://www.va.gov/vetapp10/files4/1035821.txt\n\nTips: If you can get an MRI ordered, have it done with a 3T machine.\n\nThere is also a \"diffusion tensor imaging\" scan aka \"DTI\". Ask your doctor to order a \"3-T MRI with DTI\".\n\nAn abnormal EEG, ( i.e., electroencephalogram ), can also be good evidence of physical brain damage from a TBI.\n\nThere is also the neuropsych testing route.",
    "Response_5": "Please allow me to make a few comments...on your comments:\n\nYou said...\"They are two separate injuries, I do not like being lumped into the PTSD crowd, told to take useless medications, and attend the weekly pity party...been there done that....doesn't do it for me\"\n\n1) Like you, I suffer from PTSD & TBI so I agree about them being 2 sep injuries. I don't enjoy the stigma PTSD carries and there are days I really wish I lost a leg instead so my disability would be obvious to others. It took me several years to realize I needed help with the symptoms and I still attend monthly CPT sessions with RVN, OIF, and OEF vets and they are anything but pity parties. Do I feel cured by continuing the treatment? Absolutely not, but WTF else can I do except go live off in the woods somewhere by myself and hide from feeling shitty all the time?\n\nYou said...\"PTSD research has made many advances over the past few years, The VA could easily claim that PTSD can get better, therefore, the future tens of thousands of PTSD afflicted could have benefit reductions. As far as I know there is no magic pill or procedure that can regrow damaged brain tissue.\"\n\n2) IMHO, the VA cannot arbitrarily decide someone's PTSD (or any other disorder) has been cured WITHOUT medical proof to back that up. Just like when a vet claims an increased rating, he/she must produce solid evidence. All one has to do is look around and see that after some 40+ years, there are still Vietnam vets suffering badly with PTSD. It is my belief that my experiences in combat will affect me for the rest of my life...just learning how to cope with it a wee bit better, that's all.\n\nIf there was a magic pill that could cure me I would've found it by now...It 'aint out there. Not for PTSD and not for TBI either.\n\nMy TBI was diagnosed, not with an MRI, but through extensive cognitive testing at a VAMC. I would encourage anyone to undergo an MRI but it alone cannot and will not preclude you from successfully winning a TBI claim injury. A good neurologist already knows that a lack of \"damage\" revealed by an MRI doesn't mean a TBI injury doesn't exist.\n\nLook, I don't mean to pick apart what you opined in this thread 'cause we're on the same team here! I hope you get what you believe is justice with your rating. I also hope you don't dismiss the PTSD diagnosis and be open to therapy, if not now, in the future."
  },
  {
    "Question_id": 68,
    "Question": "Ok this situation is giving me more headaches than the ones I have already. K, this is the situation, I was knocked out in Iraq because an IED went off under neath my truck, I was the gunner and I was out for about 20 seconds, the truck completely destroyed, luckily we didn't flip but there was no engine on the truck at the end, now I have a medical document that says I had a mild concussion because of terrorists attack, now the army is saying that 3 page medical report they I got from Iraq (like the one you get when they print it for u in a military clinic when u request it), they say is not enough proof, now what is the regulation for a concusion is it a tbi or not, should I let it go, anyone that I need to talk to on the military side so I can get help to het an lod, also a lod was initiated but never returned to me by the time i left iraq, I'm also heading for a med on approved ptsd Lod and sleep apnea on approve LoD, but they don't want to approve my tbi LoD any help or guidance. Thanks",
    "Response_1": "but they don't want to approve my tbi LoD any help or guidance. Thanks\"\n\nDo you mean the VA has rejected or questioned the LOD?\n\nor the Army:\n\n\"now the army is saying that 3 page medical report they I got from Iraq (like the one you get when they print it for u in a military clinic when u request it), they say is not enough proof\"\n\nDo you have a formal VA denial letter of the TBI claim?\n\nIf so can you scan and attach it here as to their reasons and bases for denial of TBI? (Cover name and C file #etc etc.)\n\nOr can you scan the Army medical report?\n\nThis is a link here to the 2008 TBI regulations:\nTBIs are rated on residuals....is that what they are questioning?\n\nIf you claimed TBI formally with the VA , they should have , or will, give you a TBI C & P exam.\n\nI am confused here about your post...........and who is questioning the LOD..... the Army or the VA.\n\nDid you get medical help for the concussion?\n\nDo you have copies of your complete SMRs? (Service medical records)",
    "Response_2": "How do you say you are 90% disability yet no VA rating?\n\nYour medical records will have this information. Navy Corpsman and Army medics use the SOAP methodology...get that information and you are gold. I have my IED exposure documented and I only lost temporary consciousness.",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 69,
    "Question": "Well after alittle over 18 months im still waiting on the my tbi claim to go throw i have done all of my comp and pen appointments close to 6 months ago my claim has been in every stage on ebenefits but now is back and stuck int the review of evidence stage i just dont know what to do but wait",
    "Response_1": "Don't do anything, just wait it out. All the contacting Senators, Congressman, writing letters to the Sec. of the VA, calling the 1-800 number, asking your VSO for help DO NOTHING BUT DELAY YOUR CLAIM. My claim took over two years then it hit special actions (program by VA to speed up cases over 24 months old) and in 2 months I was paid.\n\nThe truth is the VA is a waiting game. I did all of the above, showed financial hardship, showed couldn't work, had military records and civilian records of problem and they still put me in line like everyone else.",
    "Response_2": "At this point your getting closer to some type of decision being made.\n\nThe waiting is the hard part so just keep hanging in there and hopefully\n\nit won't be much longer.",
    "Response_3": "What you can do for yourself and as it was said to you by the moderator; you have to manage your claim. One way to do that is by making it to ALL of your VA appointments. discussing with your primary doctor all of the things you are experiencing even the personal ones like \"ED\". Sometimes you may have to suggest a consult with your primary if you bevieve the problem is getting out of control. I was every bit one a self-made-man, but I had to learn to embrace the treatment. Above all, if you have the means to see a doctor that is not affilliated with the VA do so, and give the results to your primary to have them added to your VA record. I believe had I not done that (as my wife strongly encouraged) I would still be running in circles trying to figure out what is wrong with me. \"Embrace the treatment\" and share your concerns with loved ones.",
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 70,
    "Question": "Hello everyone, I wanted to get some information about how to rebuttal the veteran administration�s decision to rate me as incompetent. The VA rated me for incompetence back in October because of my severe memory loss due to a traumatic brain injury. I feel that I can manage money quite well, in fact much better than most without a tbi. I am young with a large amount of money invested for my age, I own 2 vehicles that are paid off with no debt whatsoever. I manage my money and pay my bills by direct deposit so I don�t have to worry about forgetting any payments and I supervise my accounts with a website called mint.com. I have no kids, no wife, no ex-wife and no drug or alcohol addiction.\n\nOne day I received a letter in the mail saying that I have been rated incompetent. It also included the brady act information and the works. I imminently called my federal recovery coordinator for help but she had none. She told me just to wait until my year of supervised direct pay is over and if found competent I will be magically off the brady act and able to go hunting again (you all know that�s not true. I also called the VFW and their advice was to wait as well. I�m afraid if I go turkey hunting this year ill bag a federal offense!\n\nHunting and shooting is the most enjoyable part of life for me and I've done nothing wrong to be demonized as a person that shouldn�t own a firearm. This is extremely wrong that our government can hurl power like this.\n\n-I need help geting off of this list so I can go hunting again please help!!!",
    "Response_1": "Dont even think of doing this alone. You need a good VA attorney like NVLSP, Mr. Carpenter, Ms Katrina Eagle, Doug Rosinski, etc. Face the facts: You are gonna pay the attornies to quash this and wait.\n\nYou will also likely need a IMO/IME rebutting whatever evidence the VA used to declare you incompetent.",
    "Response_2": "One day I received a letter in the mail saying that I have been rated incompetent\"\n\nDo you mean the VA sent you a letter proposing to declare you incompetent?\n\nWhen did this letter arrive? Did you ask VA for a hearing?",
    "Response_3": "Your a victim. Why did you tell mental health you liked to play with guns? You are not alone. Here is some history:\n\nLast year thousands of vets lost their rights to own fire arms due to being placed on a list. These vets were assigned a fudiciary. There are about 100.000 of you so youi are not alone. http://dailycaller.com/2011/10/18/senators-va-has-denied-gun-rights-to-more-than-100000-veterans/\n\nI hope you get them back soon. I would hate for you to miss any hunting or competitions. I would be upset If I couldn't fish any Bass Tournaments either.",
    "Response_4": "Get a copy of the letter from the lady. Send it yourself certified mail return recipt. The VA loses stuff very often.\n\nYou are likely dealing with 1 individual A hole in the RO. DO you have a copy of your credit report? If you do, that would be positive evidence that you are competent. You can write a Notice of disagreement of any decision the VA makes and use their own system and take them all the way to federal court. Now if their actions harm you and you are competent and they cause you to miss out financially, you may be able to sue. You can also be represented by a VSO and dont have to get an attorney. A good IMO from a High Ranking Psychiatrist may do you some good.\n\nDon't give up. Fight this.",
    "Response_5": "This issue has popped up on a lot of veterans who suffer from some form of mental issues. There is nothing on the ATF form 4473 that asks if you have been ruled incompetant by the VA. The only question is have you been adjudicated as a mental defective or suffer from a mental illness or admitted to a mental institution? I know thats not exactly the way its worded, but that is the best I can remember. The NICS check is for domestic violence convictions, felony conviction and serious misdemeanors. I am not sure how the VA is justifying this but they are sending out letters. I think (dont quote me on this) the NRA is looking into it. I think an IMO would be a good idea, a good lawyer that works VA cases, and maybe write a congressman. We have congressman that cant handle their own finances. I dont understand the wait part of it from the VA. Wait for what? This all came about from Newtown CT where 28 children and adults were killed by a nutcase who had been planning the attack for a long time. Most of the other posts are giving you good advice. Spend the money and hire a lawyer. He/She can represent you much better than you trying to represent yourself. I have a friend who was detained over 50 years ago, questioned about a theft, found not to be involved and moved on to law enforcement and gave 35 years service to a department, retired, went to a sporting goods store to buy a shotgun and he could not pass a NICS check, because the Feds failed to do a follow up on the results of his detention. He is getting it straightened out so there is a way. Good luck."
  },
  {
    "Question_id": 71,
    "Question": "Hello Fellow Veterans,\n\nI am filing for TBI. I had a accident in the military where I fell down a stairwell with a mattress and the mattress landed on top of me broke my leg and sandwiched me in the ground. It was documented but they didn't document Loss Of conscience and neither did I since I was more concerned with my Broken Leg that was in intense pain. I do have two buddies that were there that saw but might be a little hard to track them down. I believe I have at least a Moderate TBI especially since I have a Growth Hormone defienciency.\n\nDo I need there statements or can I prove it with my MSR and A couple of private doctor opinions? I am also PTSD 100% P&T\n\nThank you",
    "Response_1": "The big problem your going to have is trying to prove the tbi to the va because tbi and ptsd are so alike its hard to tell them apart. From what i have been told and been throw trying to prove and file my own tbi injury some thing they seem to look at is your Secondary's to tbi (by Secondary i mean things that having a tbi would change or make worse) like headaches memory loss, depression, anxiety, vision and hearing loss (just some of the big ones) I don't think you will need the statements the doctor opinions and your MSR should be ok",
    "Response_2": "Unless you lost conscience, you will be classified at mild and I highly doubt you have a shot at moderate, unless there is more than what you listed in your post. I'm a good example; I lost a 3inch by 4 inch piece of skull, have underlining brain damage and several sequeal problems and I'm classified as having a mild TBI.\n\nLoss of conscience seems to be the ticket.",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 72,
    "Question": "I was looking at my C&P and see the statement \"suffers from a mild TBI\". I had a 3 inch by 4 inch piece of skull removed and documented underlying brain damage. My question is, II lost a large piece of skull, have brain damage, disfiguring scar, chronic migrains and numerous sequal problem and the C&P states \"mild TBI\" what does it take to be classified as moderate or severe?\n\nJust doesn't make sense, I would have thought I have at least a moderate TBI if not severe.\n\nThanks",
    "Response_1": "VA has proposed to punch up their definitions of TBIs as mild, moderate and severe,\n\nas within this link:\nI didnt post the whole regulation.\n\nIt would be great if you might be able to comment on this reg, I am working on my comment this afternoon, as you,in fact, are one of the disabled veterans these proposed new TBI regs could help,in getting a proper rating.\n\nThis is the past TBI rating schedule:\nAre you unemployable solely due to your TBI residuals?\n\nDid the C & P doc make any statement to that effect in the C & p results?\n\nDid the C & P cover all the residuals you mentioned here?\n\n(\"suffers from a mild TBI\" \"mild\" my butt)",
    "Response_2": "I am in complete agreement with you. I think it is past time vets stopped looking at the va the same way the American public at large Views them. In my humble opinion, the entire va system is a facade the politicians set up to permit the rest of our non-serving citizenry to sleep better at night believing they have done a righteous service to those who bear and have Bourne the brunt of the nations wars, nothing more. To the veteran however this system serves the real purpose of separating the vet from what's due him to the extent possible or at least delaying just long enough for them to make the most interest on what they do pay out . Basically the excuse of war gives the politicians access to the slush fund while delaying payments to the vets gives them more time at the casino gambling with the cash. Both the public and the vet lose in this deal while the politicians laugh all the way to the bank. It's a sad game, but we have to endure it because its the only game in town.",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 73,
    "Question": "VA currently service connected me for the following conditions:\n\nPTSD 100% P & T\n\nGERD 30%\n\nHead Injury Scar 0%\n\nRight elbow Residuals Scars 0%\n\nRight Knee Residual Scar 0%\n\nHeadaches 0%\n\nMy question is since I have a Head Injury Scar that's service connected for my combat operation in Iraq. Should I also put in a claim for TBI, Since VA only diagnosed me with a mTBI like years ago and told me to only get treatment from the PTSD clinic. Should I also file claims for the residual conditions for TBI and GERD? I think I got cheated off by listening to the VA Rep to put in only for the scar conditions.\n\nWell, I was never treated in the Military for TBI, nor any of the Docs knew what TBI were back in 2003-2004. They just gave me some field dressing to clean the head wound when we were out on patrol, and that was the end of that. If you were in my situation, what would you do? Please name the ALL the conditions which you think I can file. Please put yourself in my shoes. Thanks Ladies and Gentlemen.\n\nP.S I am also worry if I put in new claims the VA would try to take away the my current 100% ratings. Pls Advise.",
    "Response_1": "congrats on your 100% p&t. I'm sort of in your situation and was wondering how long it took you to win your case and with which RO did you have to deal. Your example might give others in your situation some insight and hope. Semper Fi devil dog.",
    "Response_2": "Going by your info posted above you are already SC'd\n\nfor Gerd.\n\nYou are eligible for medical care for any and all medical conditions\n\nand any needed RX meds.\n\nAnytime a claimant submits a request for additional / increased benefits, it\n\nautomatically allows for a new look-see at whatever is currently provided.",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 74,
    "Question": "I have a very complex case as I was diagnosed with Schizophrenic Reaction Paranoid type back in 1981-1982. I had fallen off my double-bunk bed a few days before complete with my ear gashed, I was e-vaced to a psych-ward and given mass amounts of anti-psychotic drugs Haldol & Cogentin just to name a few in my C-File my observing doctors could not come up with a prognosis either subdural Hematoma (brain-Injury) or psychosis. In my C-File it was decided that in view of suspicion if head injury continued observation of focal neurological sings was recommended but the psychotic diagnosis remained . My point is I feel that I was misdiagnosed & I have stated this in my claim. I have multiple symptoms indicative of PTSD, Depression, Anger, Sleep-Apnea, Apathy, grinding my teeth extreme fatigue. I have a TBI screening coming up pending the outcome I am hoping for a rating, I also have no explaination why or how I missed my last evaluation in 1984. I was pretty messed up then like I am now and possibly denial which is a symptom of TBI...bu",
    "Response_1": "Did you ever claim the schizophrenia?\n\nAny psychosis that manifests itself in service or is at least at 10% disabling within one year of service (by medical evidence)is fully service connectable under the Chronic Presumptive regs.\n\nThey are here:",
    "Response_2": "The retro date is usually based on the date they received the claim but I assume they dropped the 10% because you failed to report to a C & P or failed to appeal the reduction....?\n\nYou might have a chance for more retro then the new re- opened claim date if there were newly discovered medical records that should have warranted a higher rating then 10%\n\nThat regulation is here searchable under Newly Discovered Service Records.\n\nAs it looks to me however your retro will go back to the date you re opened this claim and I hope you provided them with New and Material Evidence. N & M evidence is also searchable here.It sounds like proof of the hospitalization alone would satisfy the N & M requirement of that came after they reduced for the psychosis claim.\n\n\"I also have no explanation why or how I missed my last evaluation in 1984.\" That could have been due to your psychosis but\n\nfrom what I see here you did not appeal the decision.\n\nAre you employed? If not do you get SSDI benefits? and if you do, what is the SSDI award for?",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 75,
    "Question": "Hi Everyone! I am currently receiving 30% combined from the VA. 10% of which is neurologic symptoms (migranes) associated with a subdemal hematoma. Should I file for an increase now since I am getting migraines more frequently or wait til my current claim is decided (Crohn's disease). Thanks!",
    "Response_1": "Have you had your c&p for the Crohn's disease yet? If you have I would wait to file the increase for TBI. If you just filed the Crohn's claim then you might as well add the TBI increase.",
    "Response_2": "If you are getting them once a month now then file now. That is a 30% rating\n\nTo meet the 50% you boss should do a statement or someone you know on how you have been losing time from work due to your headaches. plus two or more of them a month.",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  },
  {
    "Question_id": 76,
    "Question": "i was told i have a tbi and most of the things that comes with it i have filled and am still waiting on whats going to happen\n\ni also filled for hearing loss headaches memory loss depression and anxiety and vision problems and Ulnar neuropathy, right elbow and fingers, right hand\n\nBut they put Tbi to include headaches and memory loss will this effect anything like make it less of a rating or more i was all ways told to make sure to file headaches different from tbi is that true\n\nRight no i am only at 10% because of my knee And with everything that has been going on with the va it has been hard so i could use all the help i can get\n\nthank you for reading this",
    "Response_1": "Im new to this but my understanding is that the va likes to lump it all into tbi. Several here have stated that they were able to get their migrains rated seperztely.\n\nGood luck with your claim",
    "Response_2": "e could use more information from you, such as: do you have a service rep ( DAV, AM LEGION, ) or someone helping you with your claims? Who is\"they\" put tbi to include headaches and memory loss together. I can only assume you mean the VA and that you have received something in writing from the VA regarding your claim. The VA can and will combine issues, and it at times it will get you a lower rating, the headaches rated under TBI being one of those situations. Migraines however, will be rated seperately. Keep posting your info on here and we will do our best to help you. Thank you for your service.",
    "Response_3": 0,
    "Response_4": 0,
    "Response_5": 0
  }
]
